// Получить реквизиты клиента.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты
// 
// Возвращаемое значение:
//  Структура - Получить реквизиты клиента:
// * НазваниеКлиента - Строка 
// * ПолноеНаименование - Строка
// * ЮридическийАдрес - Строка 
// * ПочтовыйКод - Строка
// * Тариф - СправочникСсылка.Скидки 
// * НИП - Строка
// * Логин - Строка
&НаСервере
Функция ПолучитьРеквизитыКлиента(КонтрагентСсылка, ДатаСреза) Экспорт
	СтруктураРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(КонтрагентСсылка, "Наименование, НаименованиеПолное, ПочтовыйКод, НИП, Логин");
	
	ЮридическийАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента); //Строка
	ПочтовыйАдрес = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(КонтрагентСсылка, Справочники.ВидыКонтактнойИнформации.ПочтовыйАдресКонтрагента); //Строка

	Структура = Новый Структура;
	Структура.Вставить("НазваниеКлиента", СтруктураРеквизитов.Наименование);
	Структура.Вставить("ПолноеНаименование", СтруктураРеквизитов.НаименованиеПолное);
	Структура.Вставить("ЮридическийАдрес", ЮридическийАдрес);
	Структура.Вставить("ПочтовыйАдрес", ПочтовыйАдрес);
	Структура.Вставить("ПочтовыйКод", СтруктураРеквизитов.ПочтовыйКод);
	//@skip-check reading-attribute-from-database
	Структура.Вставить("Тариф", Exprovip.ПолучитьВидСкидкиКонтрагента(КонтрагентСсылка, ДатаСреза));
	Структура.Вставить("НИП", СтруктураРеквизитов.НИП);
	Структура.Вставить("Логин", СтруктураРеквизитов.Логин);
	
	//@skip-check constructor-function-return-section
	Возврат Структура;	
	
КонецФункции