// Структура строки эксель для загрузки.
// 
// Возвращаемое значение:
//  Структура - Структура строки эксель для загрузки:
// * КартаСтрока - Строка - 
// * Карта - СправочникСсылка.Карточки - 
// * ДатаТранзакции - Дата - 
// * Количество - Число - 
// * ПродуктСтрока - Строка - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Цена - Число - 
// * Сумма - Число - 
// * МестоТранзакцииСтрока - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Клиент - СправочникСсылка.Автомобили - 
Функция СтруктураСтрокиЭксельДляЗагрузки() Экспорт
	Структура = Новый Структура();
	Структура.Вставить("КартаСтрока", "");
	Структура.Вставить("Карта", Справочники.Карточки.ПустаяСсылка());
	Структура.Вставить("ДатаТранзакции", Дата(1, 1, 1));
	Структура.Вставить("Количество", 0);
	Структура.Вставить("ПродуктСтрока", "");
	Структура.Вставить("Продукт", Справочники.Номенклатура.ПустаяСсылка());
	Структура.Вставить("Цена", 0);
	Структура.Вставить("Сумма", 0);
	Структура.Вставить("МестоТранзакцииСтрока", "");
	Структура.Вставить("МестоТранзакции", Справочники.МестаТранзакции.ПустаяСсылка());
	Структура.Вставить("Клиент", Справочники.Контрагенты.ПустаяСсылка());
	Структура.Вставить("Автомобиль", Справочники.Автомобили.ПустаяСсылка());
		
	Возврат Структура;
КонецФункции

// Соответствие карточек.
// 
// Возвращаемое значение:
//  Соответствие - Соответствие карточек
Функция СоответствиеКарточек() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Наименование КАК Ключ,
	|	Карточки.Ссылка КАК Значение
	|ИЗ
	|	Справочник.Карточки КАК Карточки";
	
	Соответствие = Новый Соответствие();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(СокрЛП(Выборка.Ключ), Выборка.Значение);
	КонецЦикла;	
	
	Возврат Соответствие;
КонецФункции

Функция СоответствиеМестТранзакций(ПапкаЗаправок) Экспорт
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МестаТранзакции.КодУчета КАК Ключ,
		|	МестаТранзакции.Ссылка КАК Значение
		|ИЗ
		|	Справочник.МестаТранзакции КАК МестаТранзакции
		|ГДЕ
		|	МестаТранзакции.Ссылка В ИЕРАРХИИ (&ПапкаЗаправок)
		|	И НЕ МестаТранзакции.ЭтоГруппа
		|	И НЕ МестаТранзакции.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ПапкаЗаправок", ПапкаЗаправок);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Соответствие.Вставить(СокрЛП(ВыборкаДетальныеЗаписи.Ключ), ВыборкаДетальныеЗаписи.Значение);
	КонецЦикла;
	
	Возврат Соответствие;
	
КонецФункции

// Соответсвие номенклатуры.
// 
// Параметры:
//  ИмяРеквизитаПоиска - Строка - Имя реквизита поиска
// 
// Возвращаемое значение:
//  Соответствие - Соответсвие номенклатуры
Функция СоответсвиеНоменклатуры(ИмяРеквизитаПоиска) Экспорт
	Соответствие = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИмяРеквизитаПоиска", ИмяРеквизитаПоиска);
	Запрос.Текст = "ВЫБРАТЬ
	|	НоменклатураИдентификаторыКодовПоставщиков.Комментарий77 КАК РеквизитПоиска,
	|	НоменклатураИдентификаторыКодовПоставщиков.ИД КАК Ключ,
	|	НоменклатураИдентификаторыКодовПоставщиков.Ссылка КАК Значение
	|ИЗ
	|	Справочник.Номенклатура.ИдентификаторыКодовПоставщиков КАК НоменклатураИдентификаторыКодовПоставщиков
	|ГДЕ
	|	НоменклатураИдентификаторыКодовПоставщиков.Комментарий77 = &ИмяРеквизитаПоиска";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(СокрЛП(Выборка.Ключ), Выборка.Значение);
	КонецЦикла;
		
	Возврат Соответствие;	
КонецФункции

Функция СоответствиеВладельцевКарт(МассивКарт) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКарточек", МассивКарт);
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Ссылка КАК Ключ,
	|	Карточки.Владелец КАК Значение
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	Карточки.Ссылка В (&МассивКарточек)";
	
	Соответствие = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;	
	
	Возврат Соответствие;
КонецФункции

Функция СоответствиеАвтомобилейКарт(МассивКарт) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивКарт", МассивКарт);
	Запрос.Текст = "ВЫБРАТЬ
	|	АвтомобилиКарточекСрезПоследних.Карточка КАК Ключ,
	|	АвтомобилиКарточекСрезПоследних.Автомобиль КАК Значение
	|ИЗ
	|	РегистрСведений.АвтомобилиКарточек.СрезПоследних(, Карточка В (&МассивКарт)) КАК АвтомобилиКарточекСрезПоследних";
	
	Соответствие = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Соответствие.Вставить(Выборка.Ключ, Выборка.Значение);
	КонецЦикла;	
	
	Возврат Соответствие;
КонецФункции	