
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабличныйДокумент = НапечататьКонверты(ПараметрКоманды);
	
	ТабличныйДокумент.Показать("Печать конвертов");
КонецПроцедуры

&НаСервере
Функция НапечататьКонверты(СписокКонтрагентов)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = Справочники.Контрагенты.ПолучитьМакет("ПечатьКонвертов");
	ОбластьКонверт = Макет.ПолучитьОбласть("Конверт");
	
	Для Каждого ТекущийКонтрагент Из СписокКонтрагентов Цикл
		СтруктураРеквизитов = Справочники.Контрагенты.ПолучитьРеквизитыКлиента(ТекущийКонтрагент, ТекущаяДата());
		
		ОбластьКонверт.Параметры.НазваниеКлиента = СтруктураРеквизитов.НазваниеКлиента;
		ОбластьКонверт.Параметры.ПочтовыйАдрес = СтруктураРеквизитов.ПочтовыйАдрес;
		ОбластьКонверт.Параметры.ПочтовыйКод = СтруктураРеквизитов.ПочтовыйКод;
		
		ТабличныйДокумент.Вывести(ОбластьКонверт);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	Возврат ТабличныйДокумент;
КонецФункции


