// @strict-types
#Область ПрограммныйИнтерфейс

// При добавлении подсистемы.
// 
// Параметры:
//  Структура - Структура
Процедура ПриДобавленииПодсистемы(Структура) Экспорт	
	Возврат;	
КонецПроцедуры

// Сформировать имя файла.
// 
// Параметры:
//  ИмяКлиента - Строка
//  ИмяКаталога - Строка
//  Расширение - Строка
// 
// Возвращаемое значение:
//  Строка - Сформировать имя файла
Функция СформироватьИмяФайла(ИмяКлиента, ИмяКаталога, Расширение) Экспорт
	СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
	
	ИмяФайла = СтрШаблон("%1\%2\%3", 
		СокрЛП(СтруктураНастроек.ПутьДляВыгрузки),
	 	СокрЛП(ИмяКлиента), 
	 	СокрЛП(ИмяКаталога));
		
	ИмяФайла = СтрЗаменить(ИмяФайла,"""",""); 
	ИмяФайла = СтрЗаменить(ИмяФайла,".",""); 
	ИмяФайла = СтрЗаменить(ИмяФайла," ","");
	ИмяФайла = СтрШаблон("%1.%2", ИмяФайла, Расширение);
	
	ПроверитьИлиСоздатьКаталог(ИмяФайла);
	
	Возврат ИмяФайла;
КонецФункции

// Сформировать имя файла по пути.
// 
// Параметры:
//  Каталог - Строка
//  ИмяФайла - Строка
//  Расширение - Строка
// 
// Возвращаемое значение:
//  Строка - Сформировать имя файла по пути
Функция СформироватьИмяФайлаПоПути(Каталог, ИмяФайла, Расширение) Экспорт
	Если ПустаяСтрока(Каталог) Тогда
		ВызватьИсключение("В настройках программы не указан каталог для выгрузки копий фактур");
	Конецесли;
	
	ИмяФайла = СтрШаблон("%1\%2.%3", Каталог, ИмяФайла, Расширение);
	
	ПроверитьИлиСоздатьКаталог(ИмяФайла);
	
	Возврат ИмяФайла;
КонецФункции

// Выгрузить таблицу ВCSV.
// 
// Параметры:
//  ТаблицаЗначений - ТаблицаЗначений
//  Разделитель - Строка
//  ИмяФайла - Строка  
Процедура ВыгрузитьТаблицуВCSV(ТаблицаЗначений, Разделитель, ИмяФайла) Экспорт
	ПроверитьИлиСоздатьКаталог(ИмяФайла);
	ТекстФайла = Новый ТекстовыйДокумент;

	СтрокаЗаголовка = "";
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
		СтрокаЗаголовка = СтрокаЗаголовка + Колонка.Имя + Разделитель;
	КонецЦикла;

	Если СтрДлина(СтрокаЗаголовка) > 0 Тогда
		СтрокаЗаголовка = Лев(СтрокаЗаголовка, СтрДлина(СтрокаЗаголовка) - СтрДлина(Разделитель));
	КонецЕсли;

	ТекстФайла.ДобавитьСтроку(СтрокаЗаголовка);

	Для Каждого СтрокаТаблицыЗначений Из ТаблицаЗначений Цикл
		СтрокаCSV = "";
		Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл
			ТекущееЗначение = СтрокаТаблицыЗначений[Колонка.Имя]; //Число, Сторока
			Текст = Строка(ТекущееЗначение);
			
			СтрокаCSV = СтрокаCSV + Текст + Разделитель;
		КонецЦикла;

		Если СтрДлина(СтрокаCSV) > 0 Тогда
			СтрокаCSV = Лев(СтрокаCSV, СтрДлина(СтрокаCSV) - СтрДлина(Разделитель));
		КонецЕсли;

		ТекстФайла.ДобавитьСтроку(СтрокаCSV);
	КонецЦикла;

	ТекстФайла.Записать(ИмяФайла, КодировкаТекста.UTF8);
КонецПроцедуры

// Получить вид скидки контрагента.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты
//  ДатаЗапроса - Дата
// 
// Возвращаемое значение:
//  СправочникСсылка.Скидки - Вид скидки контрагента
Функция ПолучитьВидСкидкиКонтрагента(КонтрагентСсылка, ДатаЗапроса) Экспорт
	ВидСкидки = Справочники.Скидки.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаЗапроса);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СкидкиКонтрагентовСрезПоследних.Скидка
	|ИЗ
	|	РегистрСведений.СкидкиКонтрагентов.СрезПоследних(&ДатаЗапроса, Контрагент = &Контрагент) КАК
	|		СкидкиКонтрагентовСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		//@skip-check property-return-type
		ВидСкидки = Выборка.Скидка;
	КонецЕсли;
	Возврат ВидСкидки;
КонецФункции

// Пропись числа.
// 
// Параметры:
//  ЗначениеЧисла - Число
//  Валюта - СправочникСсылка.Валюты
// 
// Возвращаемое значение:
//  Строка - Пропись числа
Функция ПрописьЧисла(ЗначениеЧисла, Валюта) Экспорт
	ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла);
	ВалютаЕвро = Справочники.Валюты.НайтиПоКоду(978);
	ВалютаДолллар = Справочники.Валюты.НайтиПоКоду(840);
	Если Валюта = ВалютаЕвро Тогда
		ФормСтрока = "L=pl_PL; ДП = Истина";
		ПарПредмета="Euro, Euro, Euro, М, cent, cent, cent, M, 2";
		ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);		
	ИначеЕсли Валюта = ВалютаДолллар Тогда
		ФормСтрока = "Л = ru_RU; ДП = Истина";
		ПарПредмета="доллар, доллара, долларов, м, цент, цента, центов, м, 2";
		ЗначениеЧислаПописью = ЧислоПрописью(ЗначениеЧисла, ФормСтрока, ПарПредмета);		
	КонецЕсли;
	Возврат ЗначениеЧислаПописью;		
КонецФункции

// Base64 from string.
// 
// Parameters:
//  String - String - String
//  ReturnBinary - Boolean - Return binary
// 
// Returns:
//  String, BinaryData - Base64 from string
Function Base64FromString(String, ReturnBinary = False) Export
	
	MemoryStream = New MemoryStream();
	DataWriter = New DataWriter(MemoryStream, TextEncoding.UTF8);
	DataWriter.WriteLine(String);
	DataWriter.Close();
	BinaryData = MemoryStream.CloseAndGetBinaryData();
	
	If ReturnBinary Then
		Return BinaryData;
	Else
		StringBase64 = Base64String(BinaryData);
		StringBase64 = Left(StringBase64, StrLen(StringBase64)-2);
		StringBase64 = StringBase64 + "==";
		Return StringBase64;
	EndIf;	
EndFunction

// Сериализовать JSON.
// 
// Параметры:
//  Значение - Неопределено
// 
// Возвращаемое значение:
//  Строка - Сериализовать JSON
Функция СериализоватьJSON(Значение) Экспорт
	Настройки = Новый ПараметрыЗаписиJSON(, Chars.Tab);
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(Настройки);
	ЗаписатьJSON(ЗаписьJSON, Значение);
	Результат = ЗаписьJSON.Close();
	Return Результат;
КонецФункции

// Deserialize JSON.
// 
// Parameters:
//  Значение - String - Value
//  ЧитатьВСоответствие - Boolean - Is map
//  ИменаСвойствСоЗначениямиДата  - Массив из Строка
// 
// Returns:
//  Arbitrary - Deserialize JSON
Function ДесериалозоватьJSON(Значение, ЧитатьВСоответствие = Ложь, ИменаСвойствСоЗначениямиДата = Неопределено) Export
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(Значение);
	Результат = ПрочитатьJSON(ЧтениеJSON, ЧитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
	ЧтениеJSON.Close();
	Return Результат;
EndFunction

// Значения реквизитов объекта.
// 
// Параметры:
//  Ссылка - ЛюбаяСсылка
//  Реквизиты - Строка
//  ВыбратьРазрешенные - Булево - Выбрать разрешенные
//  КодЯзыка - Неопределено - Код языка
// 
// Возвращаемое значение:
//  Структура - Значения реквизитов объекта:
// * Ошибка - Булево - 
// * ОписаниеОшибки - Строка - 
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь, Знач КодЯзыка = Неопределено) Экспорт
	//@skip-check constructor-function-return-section
	//@skip-check invocation-parameter-type-intersect
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные, КодЯзыка);
КонецФункции	

#КонецОбласти

#Область СлужебныеПрцедурыИФункции

// Проверить или создать каталог.
// 
// Параметры:
//  ПолныйПутьКФайлу - Строка
Процедура ПроверитьИлиСоздатьКаталог(ПолныйПутьКФайлу)
	Файл = Новый Файл(ПолныйПутьКФайлу);
	ПутьККаталогу = Файл.Путь;
	Каталог = Новый Файл(ПутьККаталогу);
	
	Если Не Каталог.Существует() Тогда
		СоздатьКаталог(ПутьККаталогу);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти