
#Область ПрограммныйИнтерфейс

// Получить структура загрузки транзакций по АПИ.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * Логин - Строка
// * НомерКонтракта - Строка
// * Пароль - Строка
// * НачалоПериода - Дата
// * КонецПериода - Дата
// 
// Возвращаемое значение:
//  Структура - См. ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций()
Функция ПолучитьСтруктураЗагрузкиТранзакцийПоАПИ(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций();
	
	PasswordBase64 = Exprovip.Base64FromString(СтруктураПараметрыЗагрузки.Пароль);
	
	ФорматнаяСтрокаДаты = "ДФ='yyyy-MM-ddTHH:mm:ss'";
	
	СтруктураЗамен = Новый Структура;
	СтруктураЗамен.Вставить("loginToExchange", СтруктураПараметрыЗагрузки.Логин);
	СтруктураЗамен.Вставить("contracttoexchange", СтруктураПараметрыЗагрузки.НомерКонтракта);
	СтруктураЗамен.Вставить("НачалоПериода", Формат(СтруктураПараметрыЗагрузки.НачалоПериода, ФорматнаяСтрокаДаты));
	СтруктураЗамен.Вставить("КонецПериода", Формат(СтруктураПараметрыЗагрузки.КонецПериода, ФорматнаяСтрокаДаты));
	
	АдресАпи = "lkapi.rn-card.ru";
	АдресРесурса = "/api/emv/v2/GetOperByContract?u=loginToExchange&contract=contracttoexchange&begin=НачалоПериода&end=КонецПериода&type=JSON";
	
	Для Каждого КлючИЗначение Из СтруктураЗамен Цикл
		АдресРесурса = СтрЗаменить(АдресРесурса, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Попытка	
		Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.Заголовки.Вставить("RnCard-Identity-Account-Pass", PasswordBase64);
		Ответ = Соединение.Получить(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		СтруктураТранзакций = Exprovip.ДесериалозоватьJSON(ТелоОтвета)
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить(ОписаниеОшибки());	
	КонецПопытки;		
	
	
	Возврат СтруктураРезультат;
	
КонецФункции	

// Получить структуру загрузки.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * АдресВоВременномХранилище - Строка
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// * РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Структура - Получить структуру загрузки:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
// * МассивЗаправкиНеНашли - Массив из Строка 
// * МассивСтрок - Массив из См. ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки()  
Функция ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций();
		
	//@skip-check missing-temporary-file-deletion
	ВременныйФайлЭксель = ПолучитьИмяВременногоФайла(СтруктураПараметрыЗагрузки.РасширениеФайла);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметрыЗагрузки.АдресВоВременномХранилище); //ДвоичныеДанные
	ДвоичныеДанные.Записать(ВременныйФайлЭксель);
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = ОписаниеОшибки();
		Возврат СтруктураРезультат;
	КонецПопытки;
	
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	Эксель.Workbooks.Open(ВременныйФайлЭксель);
	Лист = Эксель.Sheets(1);
	
	СчетчикПустых = 0;
	МассивКарточек = Новый Массив;
	Для Сч = 3 По 100000 Цикл
		Если СчетчикПустых = 1000 тогда
			Прервать;
		КонецЕсли;
		ТекущееЗначениеКарты = Лист.Cells(Сч, 3).Value;
		
		ДатаТранзакции = Лист.Cells(Сч, 2).Value;
		
		НомерКарточки = СокрЛП(ТекущееЗначениеКарты);
		НомерКарточки = СтрЗаменить(НомерКарточки, Символы.НПП, "");
		Если ТипЗнч(ДатаТранзакции) <> Тип("Дата") Тогда
			СчетчикПустых = СчетчикПустых + 1;
			Продолжить;
		Иначе
			СчетчикПустых = 0;
		КонецЕсли;
		
		ЭмитентАЗС		= Лист.Cells(Сч, 18).Value;
		КодЗаправки		= СокрЛП(ЭмитентАЗС);
		
		ПродуктСтрокой = СокрЛП(Лист.Cells(Сч, 15).Value);
		
		КолВо	= Окр(Лист.Cells(Сч, 7).Value, 2);
		Цена	= Окр(Лист.Cells(Сч, 10).Value, 2);
		
		Если ЗначениеЗаполнено(ДатаТранзакции) Тогда		
			
			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока				= НомерКарточки;
			СтруктураСтроки.Карта					= СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции			= ДатаТранзакции;
			СтруктураСтроки.Количество				= КолВо;
			СтруктураСтроки.ПродуктСтрока			= ПродуктСтрокой;
			СтруктураСтроки.Продукт					= СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
			СтруктураСтроки.Цена					= Цена;
			СтруктураСтроки.Сумма					= Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока	= КодЗаправки;
			СтруктураСтроки.МестоТранзакции 		= СоответствиеМестТранзакций.Получить(КодЗаправки);
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);
			
			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);		
			
		КонецЕсли;	
	КонецЦикла;
	Эксель.ActiveWorkbook.Close(Строка(0));
	Эксель.Quit();
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;	
	
	Возврат СтруктураРезультат;
КонецФункции
#КонецОбласти		