
Функция АдресАПИ()
	АдресАпи = "lkapi.rn-card.ru";
	
	Возврат АдресАпи;	
КонецФункции

#Область ПрограммныйИнтерфейс

// Получить структура загрузки транзакций по АПИ.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * Логин - Строка
// * НомерКонтракта - Строка
// * Пароль - Строка
// * НачалоПериода - Дата
// * КонецПериода - Дата
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// Возвращаемое значение:
//  Структура - См. ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций() 
Функция ПолучитьСтруктураЗагрузкиТранзакцийПоАПИ(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций();
	
	PasswordBase64 = Exprovip.Base64FromString(СтруктураПараметрыЗагрузки.Пароль);
	
	ФорматнаяСтрокаДаты = "ДФ='yyyy-MM-ddTHH:mm:ss'";
	
	СтруктураЗамен = Новый Структура;
	СтруктураЗамен.Вставить("loginToExchange", СтруктураПараметрыЗагрузки.Логин);
	СтруктураЗамен.Вставить("contracttoexchange", СтруктураПараметрыЗагрузки.НомерКонтракта);
	СтруктураЗамен.Вставить("НачалоПериода", Формат(СтруктураПараметрыЗагрузки.НачалоПериода, ФорматнаяСтрокаДаты));
	СтруктураЗамен.Вставить("КонецПериода", Формат(СтруктураПараметрыЗагрузки.КонецПериода, ФорматнаяСтрокаДаты));
	
	АдресАпи = АдресАПИ();
	АдресРесурса = "/api/emv/v2/GetOperByContract?u=loginToExchange&contract=contracttoexchange&begin=НачалоПериода&end=КонецПериода&type=JSON";
	
	Для Каждого КлючИЗначение Из СтруктураЗамен Цикл
		АдресРесурса = СтрЗаменить(АдресРесурса, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Попытка	
		СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
		СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок, "КодУчетаАПИ");
		СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
		Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.Заголовки.Вставить("RnCard-Identity-Account-Pass", PasswordBase64);
		Ответ = Соединение.Получить(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		МассивТиповДата = Новый Массив();
		МассивТиповДата.Добавить("Date");
		
		СтруктураТранзакций = Exprovip.ДесериалозоватьJSON(ТелоОтвета, , МассивТиповДата);
		
		МассивКарточек = Новый Массив;
		Для Каждого Транзакция Из СтруктураТранзакций.OperationList Цикл
			ТекущееЗначениеКарты = Транзакция.Card;

			ДатаТранзакции = Транзакция.Date;

			НомерКарточки = СокрЛП(ТекущееЗначениеКарты);
			НомерКарточки = СтрЗаменить(НомерКарточки, Символы.НПП, "");			
			
			Если ПустаяСтрока(НомерКарточки) Тогда
				Продолжить;
			КонецЕсли;	
			
			КодЗаправки		= Транзакция.PosCode;

			ПродуктСтрокой = Транзакция.DTL;

			КолВо	= Транзакция.Value;
			Цена	= Транзакция.Price;

			Если ЗначениеЗаполнено(ДатаТранзакции) Тогда

				СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
				СтруктураСтроки.КартаСтрока				= НомерКарточки;
				СтруктураСтроки.Карта					= СоответствиеКарточек.Получить(НомерКарточки);
				СтруктураСтроки.ДатаТранзакции			= ДатаТранзакции;
				СтруктураСтроки.Количество				= КолВо;
				СтруктураСтроки.ПродуктСтрока			= ПродуктСтрокой;
				СтруктураСтроки.Продукт					= СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
				СтруктураСтроки.Цена					= Цена;
				СтруктураСтроки.Сумма					= Цена * КолВо;
				СтруктураСтроки.МестоТранзакцииСтрока	= КодЗаправки;
				СтруктураСтроки.МестоТранзакции 		= СоответствиеМестТранзакций.Получить(КодЗаправки);
				СтруктураСтроки.МестоТранзакцииАдрес	= Транзакция.Address;

				МассивКарточек.Добавить(СтруктураСтроки.Карта);

				СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);				
			КонецЕсли;				
		КонецЦикла;	
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить(ОписаниеОшибки());	
	КонецПопытки;
		
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;	
	
	//@skip-check constructor-function-return-section
	Возврат СтруктураРезультат;
	
КонецФункции	

// Получить структуру загрузки.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * АдресВоВременномХранилище - Строка
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// * РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Структура - Получить структуру загрузки:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
// * МассивЗаправкиНеНашли - Массив из Строка 
// * МассивСтрок - Массив из См. ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки()  
Функция ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций();
		
	//@skip-check missing-temporary-file-deletion
	ВременныйФайлЭксель = ПолучитьИмяВременногоФайла(СтруктураПараметрыЗагрузки.РасширениеФайла);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметрыЗагрузки.АдресВоВременномХранилище); //ДвоичныеДанные
	ДвоичныеДанные.Записать(ВременныйФайлЭксель);
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = ОписаниеОшибки();
		Возврат СтруктураРезультат;
	КонецПопытки;
	
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	Эксель.Workbooks.Open(ВременныйФайлЭксель);
	Лист = Эксель.Sheets(1);
	
	СчетчикПустых = 0;
	МассивКарточек = Новый Массив;
	Для Сч = 3 По 100000 Цикл
		Если СчетчикПустых = 1000 тогда
			Прервать;
		КонецЕсли;
		ТекущееЗначениеКарты = Лист.Cells(Сч, 3).Value;
		
		ДатаТранзакции = Лист.Cells(Сч, 2).Value;
		
		НомерКарточки = СокрЛП(ТекущееЗначениеКарты);
		НомерКарточки = СтрЗаменить(НомерКарточки, Символы.НПП, "");
		Если ТипЗнч(ДатаТранзакции) <> Тип("Дата") Тогда
			СчетчикПустых = СчетчикПустых + 1;
			Продолжить;
		Иначе
			СчетчикПустых = 0;
		КонецЕсли;
		
		ЭмитентАЗС		= Лист.Cells(Сч, 18).Value;
		КодЗаправки		= СокрЛП(ЭмитентАЗС);
		
		ПродуктСтрокой = СокрЛП(Лист.Cells(Сч, 15).Value);
		
		КолВо	= Окр(Лист.Cells(Сч, 7).Value, 2);
		Цена	= Окр(Лист.Cells(Сч, 10).Value, 2);
		
		Если ЗначениеЗаполнено(ДатаТранзакции) Тогда		
			
			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока				= НомерКарточки;
			СтруктураСтроки.Карта					= СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции			= ДатаТранзакции;
			СтруктураСтроки.Количество				= КолВо;
			СтруктураСтроки.ПродуктСтрока			= ПродуктСтрокой;
			СтруктураСтроки.Продукт					= СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
			СтруктураСтроки.Цена					= Цена;
			СтруктураСтроки.Сумма					= Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока	= КодЗаправки;
			СтруктураСтроки.МестоТранзакции 		= СоответствиеМестТранзакций.Получить(КодЗаправки);
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);
			
			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);		
			
		КонецЕсли;	
	КонецЦикла;
	Эксель.ActiveWorkbook.Close(Строка(0));
	Эксель.Quit();
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;	
	
	Возврат СтруктураРезультат;
КонецФункции

// Баланс по договору.
// 
// Параметры:
//  ПоставщикСсылка - СправочникСсылка.Контрагенты
// 
// Возвращаемое значение:
//  Структура - Баланс по договору:
// * Результат - Булево - 
// * Баланс - Структура - :
// ** СобственныеСредства - Число - 
// ** ДоступноСредств - Число - 
// ** КредитныйЛимит - Число - 
// ** Заблокировано - Число -
// ** НеснижаемыйОстаток - Число -  
// * МассивОшибок - Массив из Строка 
Функция БалансПоДоговору(ПоставщикСсылка) Экспорт
	СтруктураБаланса = Новый Структура;
	СтруктураБаланса.Вставить("СобственныеСредства", 0);
	СтруктураБаланса.Вставить("ДоступноСредств", 0);
	СтруктураБаланса.Вставить("КредитныйЛимит", 0);
	СтруктураБаланса.Вставить("Заблокировано", 0);
	СтруктураБаланса.Вставить("НеснижаемыйОстаток", 0);	
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("Баланс", СтруктураБаланса);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	
	СтруктураРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ПоставщикСсылка, 
		"ЛогинАПИ, НомерКонтракта, ПарольАПИ");
	
	PasswordBase64 = Exprovip.Base64FromString(СтруктураРеквизитовКонтрагента.ПарольАПИ);
	
	СтруктураЗамен = Новый Структура;
	СтруктураЗамен.Вставить("loginToExchange", СтруктураРеквизитовКонтрагента.ЛогинАПИ);
	СтруктураЗамен.Вставить("contracttoexchange", СтруктураРеквизитовКонтрагента.НомерКонтракта);
		
	АдресАпи = АдресАПИ();
	АдресРесурса = "/api/emv/v1/GetContractBalance?u=loginToExchange&contract=contracttoexchange&type=JSON";
	
	Для Каждого КлючИЗначение Из СтруктураЗамен Цикл
		АдресРесурса = СтрЗаменить(АдресРесурса, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Попытка	
		Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.Заголовки.Вставить("RnCard-Identity-Account-Pass", PasswordBase64);
		Ответ = Соединение.Получить(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
			
		СтруктураБаланса = Exprovip.ДесериалозоватьJSON(ТелоОтвета);
		
		СтруктураРезультат.Баланс.СобственныеСредства = СтруктураБаланса.Balance;
		СтруктураРезультат.Баланс.ДоступноСредств = СтруктураБаланса.Available;
		СтруктураРезультат.Баланс.КредитныйЛимит = СтруктураБаланса.CreditLimit;
		СтруктураРезультат.Баланс.Заблокировано = СтруктураБаланса.Blocked;
		СтруктураРезультат.Баланс.НеснижаемыйОстаток = СтруктураБаланса.AddLimit;
		
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить(ОписаниеОшибки());	
	КонецПопытки;	
	
	Возврат СтруктураРезультат;
КонецФункции

// Заблокировать карту.
// 
// Параметры:
//  Эмитент - СправочникСсылка.Контрагенты - 
//  Карта - СправочникСсылка.Карточки - 
// 
// Возвращаемое значение:
//  Структура - Заблокировать карту:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
Функция ЗаблокироватьКарту(Эмитент, Карта) Экспорт
	Возврат ИзменитьБлокировкуКарты(Эмитент, Карта, Истина);	
КонецФункции

// Заблокировать карту.
// 
// Параметры:
//  Эмитент - СправочникСсылка.Контрагенты - 
//  Карта - СправочникСсылка.Карточки - 
// 
// Возвращаемое значение:
//  Структура - Заблокировать карту:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
Функция РазблокироватьКарту(Эмитент, Карта) Экспорт
	Возврат ИзменитьБлокировкуКарты(Эмитент, Карта, Ложь);
КонецФункции


// Заблокировать карту.
// 
// Параметры:
//  Эмитент - СправочникСсылка.Контрагенты - 
//  Карта - СправочникСсылка.Карточки -
//  Заблокировать - Булево 
// 
// Возвращаемое значение:
//  Структура - Заблокировать карту:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка
Функция ИзменитьБлокировкуКарты(Эмитент, Карта, Заблокировать = Истина) Экспорт
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	
	АдресАПИ = АдресАПИ();
	
	СтруктураРеквизитовКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Эмитент, 
	"ЛогинАПИ, НомерКонтракта, ПарольАПИ");
	
	PasswordBase64 = Exprovip.Base64FromString(СтруктураРеквизитовКонтрагента.ПарольАПИ);
	
	СтруктураЗамен = Новый Структура;
	СтруктураЗамен.Вставить("loginToExchange", СтруктураРеквизитовКонтрагента.ЛогинАПИ);
	СтруктураЗамен.Вставить("contracttoexchange", СтруктураРеквизитовКонтрагента.НомерКонтракта);
	//@skip-check reading-attribute-from-database
	СтруктураЗамен.Вставить("CardToExchange", Карта.Наименование);
	
	АдресАпи = АдресАПИ();
	Если Заблокировать Тогда
		АдресРесурса = "/api/emv/v1/BlockingCard";
	Иначе
		АдресРесурса = "/api/emv/v1/UnblockingCard";
	КонецЕсли;		
	
	Попытка	
		///
		Заголовки=Новый Соответствие();
		Заголовки.Вставить("RnCard-Identity-Account-Pass", PasswordBase64);
		Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		
		Запрос=Новый HTTPЗапрос();
		Запрос.АдресРесурса = АдресРесурса;
		Запрос.Заголовки = Заголовки;
		
		Тело = "U=loginToExchange&Contract=contracttoexchange&Card=CardToExchange";
		Для Каждого КлючИЗначение Из СтруктураЗамен Цикл
			Тело = СтрЗаменить(Тело, КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		Запрос.УстановитьТелоИзСтроки(Тело);
		
		Соединение=Новый HTTPСоединение(АдресАпи,,,,,,Истина);//таким образом полный URL запроса http://api.yourserver.ru/clients/add
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		КодСостояния = Ответ.КодСостояния;
		Если КодСостояния <> 200 Тогда		
			ТекстОшибки = СтрШаблон("Код состояния %1. Ответ %2:", Ответ.КодСостояния, Ответ.ПолучитьТелоКакСтроку());
			СтруктураРезультат.МассивОшибок.Добавить(ТекстОшибки);
			СтруктураРезультат.Результат = Ложь;
		КонецЕсли;		
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить(ОписаниеОшибки());	
	КонецПопытки;	
	
	Возврат СтруктураРезультат;

КонецФункции	
#КонецОбласти		