// Получить настройки.
// 
// Возвращаемое значение:
//  Структура - Получить настройки:
// * EUR - СправочникСсылка.Валюты - 
// * USD - СправочникСсылка.Валюты - 
// * RUB - СправочникСсылка.Валюты - 
// * BYN - СправочникСсылка.Валюты -
// * ПутьДляВыгрузки - Строка
// * ПутьДляВыгрузкиИнвойсов - Строка  
Функция ПолучитьНастройки() Экспорт
	Структура = Новый Структура;
	Структура.Вставить("EUR", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("USD", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("RUB", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("BYN", Справочники.Валюты.ПустаяСсылка());
	Структура.Вставить("ПутьДляВыгрузки", "");
	Структура.Вставить("ПутьДляВыгрузкиИнвойсов", "");
	Структура.Вставить("ПутьДляКопийФактур", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Настройки.EUR КАК EUR,
	|	Настройки.USD КАК USD,
	|	Настройки.RUB КАК RUB,
	|	Настройки.BYN КАК BYN,
	|	Настройки.ПутьДляВыгрузки КАК ПутьДляВыгрузки,
	|	Настройки.ПутьДляВыгрузкиИнвойсов КАК ПутьДляВыгрузкиИнвойсов,
	|	Настройки.ПутьДляКопийФактур КАК ПутьДляКопийФактур
	|ИЗ
	|	Справочник.Настройки КАК Настройки
	|ГДЕ
	|	Настройки.Ссылка = ЗНАЧЕНИЕ(Справочник.Настройки.ПредопределенныеНастройки)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	
	Возврат Структура;
КонецФункции