#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоказатьТолькоАктивные = Истина;
	УстановитьОтборАктивнойНоменклатуры(Список, ПоказатьТолькоАктивные);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказатьТолькоАктивныеПриИзменении(Элемент)
	УстановитьОтборАктивнойНоменклатуры(Список, ПоказатьТолькоАктивные);	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборАктивнойНоменклатуры(СписокНоменклатуры, ТолькоАктивные)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокНоменклатуры,
		"Активный",
		Истина,
		ВидСравненияКомпоновкиДанных.Равно,
		,
		ТолькоАктивные);
КонецПроцедуры

#КонецОбласти
