&НаКлиенте
Процедура Очистить(Команда)
	Объект.Транзакции.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
  СтандартнаяОбработка = Ложь;

  Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
  Диалог.Фильтр = "Документ Excel (*.xlsx;*.xls)|*.xlsx;*.xls";
  Диалог.Заголовок = "Выберите документ Excel";
  Диалог.МножественныйВыбор = Ложь;

  ОповещениеЗавершения = Новый ОписаниеОповещения("ОкончаниеВыбораФайлаЗагрузки", ЭтотОбъект);
  
  Диалог.Показать(ОповещениеЗавершения); 
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораФайлаЗагрузки(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	ПутьКФайлу = Результат[0];	
КонецПроцедуры

// Структура для загрузки.
// 
// Возвращаемое значение:
//  Структура - Структура для загрузки:
// * АдресВоВременномХранилище - Строка - 
// * ПапкаЗаправок - Неопределено -
// * РеквизитПоискаНоменклатуры - Строка - 
// * РасширениеФайла - Строка - 
&НаКлиенте
Функция СтруктураПараметрыЗагрузки()
	Структура = Новый Структура;
	Структура.Вставить("АдресВоВременномХранилище", "");
	Структура.Вставить("ПапкаЗаправок", Неопределено);
	Структура.Вставить("РеквизитПоискаНоменклатуры", "");
	Структура.Вставить("РасширениеФайла", "");
	
	Возврат Структура; 
КонецФункции	

&НаКлиенте
Процедура ЗагрузкаБеларусьнефть(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДБеларусьнефть", ЗагрузкаБеларусьнефь);		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТранзитКард(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДТранзиткарт", ЗагрузкаТранзитКард);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТатнефть(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДТатнефть", ЗагрузкаТатнефть);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаЗаправкинаКлиенте(РеквизитПоискаНоменклатуры, МодульЗагрузки)
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите файл загрузки", , "ПутьКФайлу");
		Возврат;
	КонецЕсли;
	СтруктураПараметрыЗагрузки = СтруктураПараметрыЗагрузки();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
	ПутьВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	Файл = Новый Файл(ПутьКФайлу);
	
	СтруктураПараметрыЗагрузки.АдресВоВременномХранилище = ПутьВременногоХранилища;
	СтруктураПараметрыЗагрузки.ПапкаЗаправок = Объект.ПапкаЗаправок;
	СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры = РеквизитПоискаНоменклатуры;
	СтруктураПараметрыЗагрузки.РасширениеФайла = Файл.Расширение;
	
	СтруктураЗагрузки = МодульЗагрузки.ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки);
	ЗагрузитьРезультат(СтруктураЗагрузки);
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезультат(СтруктураЗагрузки)
	Если Не СтруктураЗагрузки.Результат Тогда
		Для Каждого Ошибка Из СтруктураЗагрузки.МассивОшибок Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);
		КонецЦикла;	
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаМассива Из СтруктураЗагрузки.МассивСтрок Цикл
		НоваяСтрока = Объект.Транзакции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);	
	КонецЦикла;	
КонецПроцедуры