&НаКлиенте
Процедура Очистить(Команда)
	Объект.Транзакции.Очистить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
  СтандартнаяОбработка = Ложь;

  Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие); 
  Диалог.Фильтр = "Документ Excel (*.xlsx;*.xls)|*.xlsx;*.xls";
  Диалог.Заголовок = "Выберите документ Excel";
  Диалог.МножественныйВыбор = Ложь;

  ОповещениеЗавершения = Новый ОписаниеОповещения("ОкончаниеВыбораФайлаЗагрузки", ЭтотОбъект);
  
  Диалог.Показать(ОповещениеЗавершения); 
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораФайлаЗагрузки(Результат, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(Результат) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	Если Результат.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Объект.ПутьКФайлу = Результат[0];	
КонецПроцедуры

// Структура для загрузки.
// 
// Возвращаемое значение:
//  Структура - Структура для загрузки:
// * АдресВоВременномХранилище - Строка - 
// * ПапкаЗаправок - Неопределено -
// * РеквизитПоискаНоменклатуры - Строка - 
// * РасширениеФайла - Строка - 
&НаКлиенте
Функция СтруктураПараметрыЗагрузки()
	Структура = Новый Структура;
	Структура.Вставить("АдресВоВременномХранилище", "");
	Структура.Вставить("ПапкаЗаправок", Неопределено);
	Структура.Вставить("РеквизитПоискаНоменклатуры", "");
	Структура.Вставить("РасширениеФайла", "");
	
	Возврат Структура; 
КонецФункции	

&НаКлиенте
Процедура ЗагрузкаБеларусьнефть(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДБеларусьнефть", ЗагрузкаБеларусьнефь);		
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТранзитКард(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДТранзиткарт", ЗагрузкаТранзитКард);	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаТатнефть(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДТатнефть", ЗагрузкаТатнефть);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаЛукойлБеларусь(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДЛукойл", ЗагрузкаЛукойлБеларусь);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаБелтол(Команда)
	ЗагрузкаЗаправкинаКлиенте("ИДБелтол", ЗагрузкаБелтол);
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаЗаправкинаКлиенте(РеквизитПоискаНоменклатуры, МодульЗагрузки)
	Если ПустаяСтрока(Объект.ПутьКФайлу) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Выберите файл загрузки", , "Объект.ПутьКФайлу");
		Возврат;
	КонецЕсли;
	СтруктураПараметрыЗагрузки = СтруктураПараметрыЗагрузки();
	
	ДвоичныеДанные = Новый ДвоичныеДанные(Объект.ПутьКФайлу);
	ПутьВременногоХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	Файл = Новый Файл(Объект.ПутьКФайлу);
	
	СтруктураПараметрыЗагрузки.АдресВоВременномХранилище = ПутьВременногоХранилища;
	СтруктураПараметрыЗагрузки.ПапкаЗаправок = Объект.ПапкаЗаправок;
	СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры = РеквизитПоискаНоменклатуры;
	СтруктураПараметрыЗагрузки.РасширениеФайла = Файл.Расширение;
	
	СтруктураЗагрузки = МодульЗагрузки.ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки);
	ЗагрузитьРезультат(СтруктураЗагрузки);
	Если Объект.Ошибки.Количество() > 0 Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаОшибки;
	КонецЕсли;		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьРезультат(СтруктураЗагрузки)
	Объект.Ошибки.Очистить();
	Если Не СтруктураЗагрузки.Результат Тогда
		Для Каждого Ошибка Из СтруктураЗагрузки.МассивОшибок Цикл
			ОбщегоНазначения.СообщитьПользователю(Ошибка);			
		КонецЦикла;	
		Возврат;
	КонецЕсли;
	Для Каждого СтрокаМассива Из СтруктураЗагрузки.МассивСтрок Цикл
		НоваяСтрока = Объект.Транзакции.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаМассива);
		Если Не ЗначениеЗаполнено(СтрокаМассива.Карта) Тогда
			ДобавитьОшибку(СтрШаблон("Не найдена карта:%1", СтрокаМассива.КартаСтрока));
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаМассива.Продукт) Тогда
			ДобавитьОшибку(СтрШаблон("Не найден продукт:%1", СтрокаМассива.ПродуктСтрока));
		КонецЕсли;	
	КонецЦикла;	
	ТаблицаОшибки = Объект.Ошибки.Выгрузить();
	ТаблицаОшибки.Свернуть("ТекстОшибки");
	Объект.Ошибки.Загрузить(ТаблицаОшибки);
КонецПроцедуры

&НаСервере
Процедура ДобавитьОшибку(ТекстОшибки)
	НоваяСтрока = Объект.Ошибки.Добавить();
	НоваяСтрока.ТекстОшибки = ТекстОшибки;	
КонецПроцедуры