// Получить сруктуру курса.
// 
// Параметры:
//  Валюта - СправочникСсылка.Валюты
//  ДатаКурса - Дата
// 
// Возвращаемое значение:
//  Структура - Получить сруктуру курса:
// * Курс - Число - 
// * Кратность - Число - 
// * КурсВзаиморасчетов - Число - 
// * КурсКЕвро - Число - 
// * КурсКДоллару - Число - 
Функция ПолучитьСруктуруКурса(Валюта, ДатаКурса) Экспорт
	Структура = Новый Структура;
	Структура.Вставить("Курс", 0);
	Структура.Вставить("Кратность", 0);
	Структура.Вставить("КурсВзаиморасчетов", 0);
	Структура.Вставить("КурсКЕвро", 0);
	Структура.Вставить("КурсКДоллару", 0);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("ДатаЗапроса", ДатаКурса);
	Запрос.Текст = "ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность,
	|	КурсыВалютСрезПоследних.КурсВзаиморасчетов,
	|	КурсыВалютСрезПоследних.КурсКЕвро,
	|	КурсыВалютСрезПоследних.КурсКДоллару
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
	КонецЕсли;
	
	Возврат Структура;

КонецФункции	