
&НаКлиенте
Процедура ОплатыВалютаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Оплаты.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОплатаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура ОплатаПриИзмененииНаСервере(ИДСтроки);
	ТекущаяСтрока = Объект.Оплаты.НайтиПоИдентификатору(ИДСтроки); 
	ТекущаяВалюта = ТекущаяСтрока.Валюта;
	Если Не ЗначениеЗаполнено(ТекущаяВалюта) Тогда
		Возврат;
	КонецЕсли;
	КурсПересчета = ПолучитьКурсПересчета(ТекущаяВалюта);
	
	ТекущаяСтрока.Курс = КурсПересчета;
	
	Если ТекущаяСтрока.Сумма = 0 Тогда
		ПересчетСтрокиОтВалютнойСуммы(ТекущаяСтрока); 	
	Иначе
		ПересчетСтрокиОтСуммы(ТекущаяСтрока); 	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Оплаты.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОплатыСуммаПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());		
КонецПроцедуры

Процедура ОплатыСуммаПриИзмененииНаСервере(ИДСтроки)
	ТекущаяСтрока = Объект.Оплаты.НайтиПоИдентификатору(ИДСтроки); 
	ТекущаяВалюта = ТекущаяСтрока.Валюта;
	Если Не ЗначениеЗаполнено(ТекущаяВалюта) Тогда
		Возврат;
	КонецЕсли;
	КурсПересчета = ПолучитьКурсПересчета(ТекущаяВалюта);
	
	ТекущаяСтрока.Курс = КурсПересчета;
	
	ПересчетСтрокиОтСуммы(ТекущаяСтрока);	
КонецПроцедуры

Процедура ОплатыСуммаВалютнаяПриИзмененииНаСервере(ИДСтроки)
	ТекущаяСтрока = Объект.Оплаты.НайтиПоИдентификатору(ИДСтроки); 
	ТекущаяВалюта = ТекущаяСтрока.Валюта;
	Если Не ЗначениеЗаполнено(ТекущаяВалюта) Тогда
		Возврат;
	КонецЕсли;
	КурсПересчета = ПолучитьКурсПересчета(ТекущаяВалюта);
	
	ТекущаяСтрока.Курс = КурсПересчета;
	
	ПересчетСтрокиОтВалютнойСуммы(ТекущаяСтрока);	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыСуммаВалютнаяПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Оплаты.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	ОплатыСуммаВалютнаяПриИзмененииНаСервере(ТекущаяСтрока.ПолучитьИдентификатор());
КонецПроцедуры

&НаСервере
Процедура ПересчетСтрокиОтСуммы(СтрокаТаблицы)
	Если СтрокаТаблицы.Курс = 0 Тогда
		Возврат;
	КонецЕсли;	
	СтрокаТаблицы.СуммаВалютная = СтрокаТаблицы.Сумма / СтрокаТаблицы.Курс;
КонецПроцедуры

&НаСервере
Процедура ПересчетСтрокиОтВалютнойСуммы(СтрокаТаблицы)
	Если СтрокаТаблицы.Курс = 0 Тогда
		Возврат;
	КонецЕсли;	
	СтрокаТаблицы.Сумма = СтрокаТаблицы.СуммаВалютная * СтрокаТаблицы.Курс;
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсПересчета(ВалютаСсылка)
	Курс = 1;
	ВалютаЕвро = Справочники.Валюты.НайтиПоКоду("978");
	Если ВалютаСсылка.Код = "933" Тогда //Бел рубль
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Валюта", ВалютаСсылка);
		Запрос.УстановитьПараметр("ДатаЗапроса", КонецДня(Объект.Дата));
		Запрос.Текст = "ВЫБРАТЬ
		               |	КурсыВалютСрезПоследних.КурсВзаиморасчетов КАК КурсВзаиморасчетов
		               |ИЗ
		               |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Курс = Выборка.КурсВзаиморасчетов;
		КонецЕсли;		
	ИначеЕсли  ВалютаСсылка.Код = "643" Тогда //Российский рубль
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Валюта", ВалютаЕвро);
		Запрос.УстановитьПараметр("ДатаЗапроса", КонецДня(Объект.Дата));
		Запрос.Текст = "ВЫБРАТЬ
		               |	КурсыВалютСрезПоследних.КурсВзаиморасчетов КАК КурсВзаиморасчетов
		               |ИЗ
		               |	РегистрСведений.КурсыВалют.СрезПоследних(&ДатаЗапроса, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Курс = Выборка.КурсВзаиморасчетов;
		КонецЕсли;
	ИначеЕсли ВалютаСсылка = ВалютаЕвро Тогда		
		Курс = 1;
	КонецЕсли;
	Возврат Курс;	
КонецФункции	               

#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
