
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтруктураПечати") = Ложь Тогда
		Возврат;
	КонецЕсли;
	//@skip-check unknown-form-parameter-access
	СтруктураПечати = Параметры.СтруктураПечати; 	
	ЗаполнитьТаблицуПечати(СтруктураПечати);
	ЗаполнитьТаблицаДанные(СтруктураПечати);
	Фактура = СтруктураПечати.Фактура;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого СтрокаТаблица Из ТаблицаПечати Цикл
		СтрокаТаблица.Выбран = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого СтрокаТаблица Из ТаблицаПечати Цикл
		СтрокаТаблица.Выбран = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьФактуры(Команда)
	Для Каждого СтрокаТЧ Из ТаблицаПечати Цикл
		Если Не СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;	
		//@skip-check query-in-loop
		Структура = ПолучитьТабличныйДокумент(СтрокаТЧ.Контрагент, СтрокаТЧ.ЭтапОплаты, СтрокаТЧ.НомерФактуры);
		ТабличныйДокумент = Структура.ТабличныйДокумент;
		ТабличныйДокумент.Показать(Структура.ИмяФайла);
		Если флагПечатьНаПринтер Тогда
			ТабличныйДокумент.Напечатать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВPDF(Команда)
	Для Каждого СтрокаТЧ Из ТаблицаПечати Цикл
		Если Не СтрокаТЧ.Выбран Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			СтруктураРеквизитовКлиента = ПолучитьРеквизитыКлиента(СтрокаТЧ.Контрагент);
			ИмяФайла = Формат(СтрокаТЧ.НомерФактуры, "ЧГ=0;");
			ИмяФайлаСПапкой = СтрШаблон("invoice\%1", ИмяФайла);
			ПутьКВыгрузки = Exprovip.СформироватьИмяФайла(СтруктураРеквизитовКлиента.Логин, ИмяФайлаСПапкой, "pdf");
			//@skip-check query-in-loop
			Структура = ПолучитьТабличныйДокумент(СтрокаТЧ.Контрагент, СтрокаТЧ.ЭтапОплаты, СтрокаТЧ.НомерФактуры);
			ТабличныйДокумент = Структура.ТабличныйДокумент;
			ТабличныйДокумент.Записать(ПутьКВыгрузки, ТипФайлаТабличногоДокумента.PDF);
			
			//Дублируем фактуру в отдельную папку
			СтруктураНастроек = ПолучитьНастройкиПрограммы();
			ИмяФайлаДубля = Exprovip.СформироватьИмяФайлаПоПути(СтруктураНастроек.ПутьДляКопийФактур, ИмяФайла, "pdf");
			ТабличныйДокумент.Записать(ИмяФайлаДубля, ТипФайлаТабличногоДокумента.PDF);
		Исключение
			Сообщение = СтрШаблон("Ошибка выгрузки %1", СтрокаТЧ.Контрагент);
			ОбщегоНазначенияКлиент.СообщитьПользователю(Сообщение);
			ОбщегоНазначенияКлиент.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;	
	КонецЦикла;	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка завершена");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Получить реквизиты клиента.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты
// 
// Возвращаемое значение:
//  Структура - Получить реквизиты клиента:
// * НазваниеКлиента - Строка 
// * ПолноеНаименование - Строка
// * ЮридическийАдрес - Строка 
// * ПочтовыйКод - Строка
// * Тариф - СправочникСсылка.Скидки 
// * НИП - Строка
// * Логин - Строка
&НаСервере
Функция ПолучитьРеквизитыКлиента(КонтрагентСсылка)
	ДатаФактуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Фактура, "Дата");
	Возврат Справочники.Контрагенты.ПолучитьРеквизитыКлиента(КонтрагентСсылка, ДатаФактуры);
КонецФункции	

&НаСервере
Процедура ЗаполнитьТаблицаДанные(СтруктураПечати)
	Документы.Фактура.ЗаполнитьТаблицаДанные(СтруктураПечати, ТаблицаДанные);	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПечати(СтруктураПечати)
	Документы.Фактура.ЗаполнитьТаблицуПечати(СтруктураПечати, ТаблицаПечати);
КонецПроцедуры

// Получить табличный документ.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты - Контрагент ссылка
//  ЭтапОплаты - Число - Этап оплаты
//  НомерФактуры - Число
// 
// Возвращаемое значение:
//  Структура - См. Документы.Фактура.СтруктураФактурыКлиента
&НаСервере
Функция ПолучитьТабличныйДокумент(КонтрагентСсылка, ЭтапОплаты, НомерФактуры)
	ТаблицаДанныеВременная = ТаблицаДанные.Выгрузить();
	
	Возврат Документы.Фактура.СтруктураФактурыКлиента(
		КонтрагентСсылка,
		ЭтапОплаты,
		НомерФактуры,
		Фактура,
		ТаблицаДанныеВременная);
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНастройкиПрограммы()
	СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
	Возврат СтруктураНастроек;
КонецФункции	

#КонецОбласти
