
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура МенюБлокировки(Команда)
	КонтрагентВладелец = Неопределено;
	Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
		Если СокрЛП(ЭлементОтбора.ЛевоеЗначение) = "Владелец" Тогда
			КонтрагентВладелец = ЭлементОтбора.ПравоеЗначение;	
		КонецЕсли;	
	КонецЦикла;	
	
	Структура = Новый Структура;
	Структура.Вставить("СтруктураЗаполнения", Новый Структура);
	Структура.СтруктураЗаполнения.Вставить("Контрагент", КонтрагентВладелец);
		
	ОткрытьФорму("Обработка.БлокировкаКарт.Форма.Форма", Структура, ЭтотОбъект, УникальныйИдентификатор, , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
#КонецОбласти