#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВзаиморасчетыСКлиентами();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВзаиморасчетыСКлиентами()
	Движения.ВзаиморасчетыКлиенты.Записывать = Истина;
	Для Каждого СтрокаТранзакции Из Транзакции Цикл
		Движение = Движения.ВзаиморасчетыКлиенты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = СтрокаТранзакции.Клиент;
		Движение.Валюта = СтрокаТранзакции.Валюта;
		Движение.Сумма = СтрокаТранзакции.Итого;
		Движение.ДатаТранзакции = СтрокаТранзакции.ДатаТранзакции;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли