#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВзаиморасчетыСКлиентами();
	ВзаиморасчетыПоставщики();
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	МассивНепроверяемыхРеквизитов = Новый Массив;
	Если СуммаЗаДороги = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПоставщикДороги");
	КонецЕсли;
	УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов)

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли; 
  КонецЦикла;
 
КонецПроцедуры

Процедура ВзаиморасчетыСКлиентами()
	Движения.ВзаиморасчетыКлиенты.Записывать = Истина;
	Для Каждого СтрокаТранзакции Из Транзакции Цикл
		Движение = Движения.ВзаиморасчетыКлиенты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = СтрокаТранзакции.Клиент;
		Движение.Валюта = СтрокаТранзакции.Валюта;
		Движение.Сумма = СтрокаТранзакции.Итого;
		Движение.ДатаТранзакции = СтрокаТранзакции.ДатаТранзакции;
	КонецЦикла;	
КонецПроцедуры

Процедура ВзаиморасчетыПоставщики()
	МассивДороги = Новый Массив();
	МассивДороги.Добавить("Drogi");
	МассивДороги.Добавить("Terminal");
	МассивДороги.Добавить("Powrot oplaty za drogi");
	МассивДороги.Добавить("Zwrot Terminala");	
	
	ИтогСуммаЗаДороги = 0;
	
	ВалютаBYR = Справочники.Валюты.НайтиПоКоду("933");
	Движения.ВзаиморасчетыПоставщики.Записывать = Истина;
	Для Каждого СтрокаТранзакции Из Транзакции Цикл
		Если СтрокаТранзакции.ВалютаПоставщика <> ВалютаBYR Тогда			
			Движение = Движения.ВзаиморасчетыПоставщики.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Контрагент = СтрокаТранзакции.Поставщик;
			Движение.Валюта = ВалютаBYR;
			Движение.ДатаТранзакции = СтрокаТранзакции.ДатаТранзакции;
			Движение.Сумма = СтрокаТранзакции.Цена * СтрокаТранзакции.Количество;
		КонецЕсли;	
		
		Если МассивДороги.Найти(СокрЛП(СтрокаТранзакции.Продукт)) <> Неопределено Тогда	
						
			ТекСуммаЗаДороги =  СтрокаТранзакции.Цена * СтрокаТранзакции.Количество;
			
			ИтогСуммаЗаДороги = ИтогСуммаЗаДороги + ТекСуммаЗаДороги;						 
		КонецЕсли;		 
	КонецЦикла;
	
	Если СуммаЗаДороги <> 0 Тогда
		//На сумму дорог	
		Движение = Движения.ВзаиморасчетыПоставщики.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ПоставщикДороги;
		Движение.Валюта = ВалютаBYR;
		Движение.ДатаТранзакции = Дата;
		Движение.Сумма = СуммаЗаДороги;
	КонецЕсли; 
	
	Если ИтогСуммаЗаДороги <> 0 И КурсЗаДороги <> 0 Тогда
		Движение = Движения.ВзаиморасчетыПоставщики.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Контрагент = ПоставщикДороги;
		Движение.Валюта = ВалютаBYR;
		Движение.ДатаТранзакции = Дата;
		Движение.СуммаДороги = ИтогСуммаЗаДороги / КурсЗаДороги;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли