#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)	
	ВзаиморасчетыКлиенты();
	ВзаиморасчетыПоставщики();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВзаиморасчетыКлиенты()
	Движения.ВзаиморасчетыКлиенты.Записывать = Истина;
	Для Каждого ТекСтрокаВзаиморасчетыКлиенты из ВзаиморасчетыКлиенты Цикл
		Движение = Движения.ВзаиморасчетыКлиенты.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Контрагент = ТекСтрокаВзаиморасчетыКлиенты.Контрагент;
		Движение.Валюта = ТекСтрокаВзаиморасчетыКлиенты.Валюта;
		Движение.Сумма = ТекСтрокаВзаиморасчетыКлиенты.Сумма;
		Движение.ДатаТранзакции = Дата;
	КонецЦикла;	
КонецПроцедуры

Процедура ВзаиморасчетыПоставщики()
	Движения.ВзаиморасчетыПоставщики.Записывать = Истина;
	Для Каждого ТекСтрокаВзаиморасчетыПоставщики из ВзаиморасчетыПоставщики Цикл
		Движение = Движения.ВзаиморасчетыПоставщики.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Контрагент = ТекСтрокаВзаиморасчетыПоставщики.Контрагент;
		Движение.Валюта = ТекСтрокаВзаиморасчетыПоставщики.Валюта;
		Движение.Сумма = ТекСтрокаВзаиморасчетыПоставщики.Сумма;
		Движение.ДатаТранзакции = Дата;
	КонецЦикла;	
КонецПроцедуры	

#КонецОбласти

#КонецЕсли
