#Область ПрограммныйИнтерфейс

// Заблокировать карту.
// 
// Параметры:
//  Эмитент - СправочникСсылка.Контрагенты - 
//  Карта - СправочникСсылка.Карточки - 
// 
// Возвращаемое значение:
//  Структура - Заблокировать карту:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка
//@skip-check redundant-export-method
Функция ЗаблокироватьКарту(Эмитент, Карта) Экспорт
	//Пока заглушка
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	
	Возврат СтруктураРезультат;
КонецФункции

// Разблокировать карту.
// 
// Параметры:
//  Эмитент Эмитент
//  Карта Карта
// 
// Возвращаемое значение:
//  Структура - Разблокировать карту:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка
//@skip-check redundant-export-method
Функция РазблокироватьКарту(Эмитент, Карта) Экспорт
	//Пока заглушка
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	
	Возврат СтруктураРезультат;
КонецФункции

// Получить структуру загрузки.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * АдресВоВременномХранилище - Строка
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// * РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Структура - Получить структуру загрузки:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
// * МассивЗаправкиНеНашли - Массив из Строка 
// * МассивСтрок - Массив из См. ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки()  
Функция ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	СтруктураРезультат.Вставить("МассивЗаправкиНеНашли", Новый Массив);
	СтруктураРезультат.Вставить("МассивСтрок", Новый Массив);
	
	ВременныйФайлЭксель = ПолучитьИмяВременногоФайла(СтруктураПараметрыЗагрузки.РасширениеФайла);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметрыЗагрузки.АдресВоВременномХранилище); //ДвоичныеДанные
	ДвоичныеДанные.Записать(ВременныйФайлЭксель);
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = ОписаниеОшибки();
		Возврат СтруктураРезультат;
	КонецПопытки;
	
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	Эксель.Workbooks.Open(ВременныйФайлЭксель);
	Лист = Эксель.Sheets(1);
	
	СчетчикПустых = 0;
	МассивКарточек = Новый Массив;
	
	ТекущаяКарта		= Неопределено;
	ТекущийПродукт		= Неопределено;
		
	МассивПризнаковПродукта = Новый Массив;
	МассивПризнаковПродукта.Добавить("дт");
	МассивПризнаковПродукта.Добавить("аи");
	
	МассивПризнакПродовольственные = Новый Массив();
	МассивПризнакПродовольственные.Добавить("продовольственные");
	МассивПризнакПродовольственные.Добавить("автотовары");
	
	Для Сч = 9 По 100000 Цикл
		Если СчетчикПустых = 1000 тогда
			Прервать;
		КонецЕсли;
		ТекущееЗначениеКарты = Лист.Cells(Сч, 2).Value;
		
		Если СтрДлина(ТекущееЗначениеКарты) = 16 Тогда
			ТекущаяКарта = ТекущееЗначениеКарты;
			Продолжить;
		КонецЕсли;
		
		ДатаТранзакции = Лист.Cells(Сч, 2).Value;
		ПродуктСтрокой = СокрЛП(Лист.Cells(Сч , 2).Value);
		ПродуктСтрокойНРег = НРег(ПродуктСтрокой);
		Для Каждого ЭлементПоиска ИЗ МассивПризнаковПродукта Цикл
			Если СтрНачинаетсяС(ПродуктСтрокойНРег, ЭлементПоиска) Тогда
				ТекущийПродукт = ПродуктСтрокой;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Для Каждого ЭлементПоиска ИЗ МассивПризнакПродовольственные Цикл
			Если СтрНайти(ПродуктСтрокойНРег, ЭлементПоиска) > 0 Тогда
				//Пока хардкодом. Файл нормально не парсится. 
				НоменклатураПромтовары = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор("C15F6800-FA8E-11F0-817B-581122C7AC93"));
				
				ТекущийПродукт = ПродуктСтрокой;
				СоответствиеНоменклатуры.Вставить(ПродуктСтрокой, НоменклатураПромтовары);
				Прервать;
			КонецЕсли;
		КонецЦикла;		
		
		НомерКарточки = СокрЛП(ТекущаяКарта);
		НомерКарточки = СтрЗаменить(НомерКарточки, Символы.НПП, "");
		Если ТипЗнч(ДатаТранзакции) <> Тип("Дата") Тогда
			СчетчикПустых = СчетчикПустых + 1;
			Продолжить;
		Иначе
			СчетчикПустых = 0;
		КонецЕсли;
		
		ЭмитентАЗС		= Лист.Cells(Сч, 10).Value;
		КодЗаправки		= СокрЛП(ЭмитентАЗС);
		
		КолВо	= - Окр(Лист.Cells(Сч, 5).Value, 2);
		Цена	= Окр(Лист.Cells(Сч, 7).Value, 2);
		
		Если ЗначениеЗаполнено(ДатаТранзакции) Тогда		
			
			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока				= НомерКарточки;
			СтруктураСтроки.Карта					= СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции			= ДатаТранзакции;
			СтруктураСтроки.Количество				= КолВо;
			СтруктураСтроки.ПродуктСтрока			= ТекущийПродукт;
			СтруктураСтроки.Продукт					= СоответствиеНоменклатуры.Получить(ТекущийПродукт);
			СтруктураСтроки.Цена					= Цена;
			СтруктураСтроки.Сумма					= Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока	= КодЗаправки;
			СтруктураСтроки.МестоТранзакции 		= СоответствиеМестТранзакций.Получить(КодЗаправки);
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);
			
			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);		
			
		КонецЕсли;	
	КонецЦикла;
	Эксель.ActiveWorkbook.Close(Строка(0));
	Эксель.Quit();
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;
	
	УдалитьФайлы(ВременныйФайлЭксель);		
	
	Возврат СтруктураРезультат;
КонецФункции

#КонецОбласти		