
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СтруктураФактуры = ПолучитьФактуру();
	Если Не СтруктураФактуры.Результат Тогда
		Отказ = Истина;
		//@skip-check undefined-variable
		ОбщегоНазначения.СообщитьПользователю(СтруктураФактуры.Ошибка);
		Возврат;
	КонецЕсли;
	СтруктураНастроек = Справочники.Настройки.ПолучитьНастройки();
	ФактураОбъект = СтруктураФактуры.ФактураСсылка.ПолучитьОбъект();
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("ДокументОснование", Ссылка);
	СтруктураПоиска.Вставить("ЭтапОплаты", 0);
	
	//МассивСтрокПоиска = ФактураОбъект.Транзакции.НайтиСтроки(СтруктураПоиска);
	//Для Каждого ЭлементМассива Из МассивСтрокПоиска Цикл
	//	ФактураОбъект.Транзакции.Удалить(ЭлементМассива);	
	//КонецЦикла;	
	ТаблицаТранзакций = Транзакции.Выгрузить();
	ТаблицаТранзакций.Свернуть("ДатаТранзакции, Карта, Клиент, Автомобиль, МестоТранзакции, Продукт, Валюта, ДатаТекст, Цена", "Количество, Сумма");
	
	Для Каждого СтрокаТЧ Из ТаблицаТранзакций Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ДатаТранзакции", СтрокаТЧ.ДатаТранзакции);
		СтруктураПоиска.Вставить("Карта", СтрокаТЧ.Карта);
		СтруктураПоиска.Вставить("Клиент", СтрокаТЧ.Клиент);
		СтруктураПоиска.Вставить("Автомобиль", СтрокаТЧ.Автомобиль);
		СтруктураПоиска.Вставить("Количество", СтрокаТЧ.Количество);
		//СтруктураПоиска.Вставить("Цена", СтрокаТЧ.Цена);

		МассивПоиска = ФактураОбъект.Транзакции.НайтиСтроки(СтруктураПоиска);
		Если МассивПоиска.Количество() > 0 Тогда
			СтрокаФактуры = МассивПоиска[0];
			////строка уже оплачена. Удалять и изменять ее не будем
			//Продолжить;
			Если МассивПоиска.Количество() <> 1 Тогда
				Сообщение = СтрШаблон("Ошибка корректировки строки: Дата:%1, Карта:%2, Клиент:%3, Автомобиль:%4, Количество:%5",
				СтрокаТЧ.ДатаТранзакции,
				СтрокаТЧ.Карта,
				СтрокаТЧ.Клиент,
				СтрокаТЧ.Автомобиль,
				СтрокаТЧ.Количество);
				
				ОбщегоНазначения.СообщитьПользователю(Сообщение);
			КонецЕсли;
		Иначе
			СтрокаФактуры = ФактураОбъект.Транзакции.Добавить();
		КонецЕсли;

		СтрокаФактуры.ДатаТранзакции = СтрокаТЧ.ДатаТранзакции;
		СтрокаФактуры.Карта = СтрокаТЧ.Карта;
		СтрокаФактуры.Клиент = СтрокаТЧ.Клиент;
		СтрокаФактуры.Автомобиль       = СтрокаТЧ.Автомобиль;
		СтрокаФактуры.МестоТранзакции  = СтрокаТЧ.МестоТранзакции;
		СтрокаФактуры.Продукт          = СтрокаТЧ.Продукт;
		СтрокаФактуры.Количество       = СтрокаТЧ.Количество;
		СтрокаФактуры.Цена             = СтрокаТЧ.Цена;
		СтрокаФактуры.Валюта           = СтрокаТЧ.Валюта;
		СтрокаФактуры.ВалютаПоставщика = ВалютаПоставщика;
		СтрокаФактуры.Поставщик        = Поставщик;
		СтрокаФактуры.ДокументОснование = Ссылка;
		Если ВалютаПоставщика = СтруктураНастроек.BYN Тогда
			СтруктураКурса = Справочники.Валюты.ПолучитьСруктуруКурса(ВалютаПоставщика, СтрокаТЧ.ДатаТранзакции);
			Если СтрокаТЧ.Валюта = СтруктураНастроек.EUR Тогда
				КурсБР 					= СтруктураКурса.КурсКЕвро;
			ИначеЕсли СтрокаТЧ.Валюта = СтруктураНастроек.USD Тогда
				КурсБР 					= СтруктураКурса.КурсКДоллару;
			Иначе
				КурсБР 					= СтруктураКурса.КурсКЕвро;
			КонецЕсли;
			СтрокаФактуры.ВалютнаяЦена 		= СтрокаТЧ.Цена / КурсБР;
			СтрокаФактуры.ВалютнаяЦенаСНадбавкой = СтрокаФактуры.ВалютнаяЦена ;
			СтрокаФактуры.Сумма = СтрокаФактуры.ВалютнаяЦенаСНадбавкой * СтрокаФактуры.Количество;
			СтрокаФактуры.ЦенаСоСкидкой = СтрокаФактуры.ВалютнаяЦенаСНадбавкой;
			СтрокаФактуры.Итого = СтрокаФактуры.ВалютнаяЦенаСНадбавкой * СтрокаФактуры.Количество;
		КонецЕсли;
	КонецЦикла;
	ФактураОбъект.Записать();
КонецПроцедуры

// Получить фактуру.
// 
// Возвращаемое значение:
//  Структура - Получить фактуру:
// * Результат - Булево - 
// * ФактураСсылка - ДокументСсылка.Фактура - 
// * Ошибка 
Функция ПолучитьФактуру()
	Структура = Новый Структура;
	Структура.Вставить("Результат", Истина);
	Структура.Вставить("ФактураСсылка", Документы.Фактура.ПустаяСсылка());
	Структура.Вставить("Ошибка");
	
	ФактураСсылка = Документы.Фактура.ПустаяСсылка();
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоМесяца(Дата));
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Дата));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК ФактураСсылка,
	|	Фактура.Проведен КАК Проведен
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Структура.Результат = Ложь;
		Структура.Ошибка = СтрШаблон("За %1 должна быть создана Фактура", Формат(Дата, "ДФ='MMMM yyyy'"));
		Возврат Структура;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Если Выборка.Количество() <> 1 Тогда
		Структура.Результат = Ложь;
		Структура.Ошибка = СтрШаблон("За %1 должна быть только одна Фактура", Формат(Дата, "ДФ='MMMM yyyy'"));
		Возврат Структура;
	КонецЕсли;
	Выборка.Следующий();
	Если Выборка.Проведен Тогда
		Структура.Результат = Ложь;
		Структура.Ошибка = СтрШаблон("Фактура %1 проведена. Изменений не будет", Выборка.ФактураСсылка);
		Возврат Структура;
	КонецЕсли;
	Структура.ФактураСсылка = Выборка.ФактураСсылка;
	
	Возврат Структура;		
КонецФункции	
