#Область ПрограммныйИнтерфейс
// Получить структуру загрузки.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * АдресВоВременномХранилище - Строка
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// * РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Структура - Получить структуру загрузки:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
// * МассивЗаправкиНеНашли - Массив из Строка 
// * МассивСтрок - Массив из См. ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки()  
Функция ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	СтруктураРезультат.Вставить("МассивЗаправкиНеНашли", Новый Массив);
	СтруктураРезультат.Вставить("МассивСтрок", Новый Массив);
	
	ВременныйФайлЭксель = ПолучитьИмяВременногоФайла(СтруктураПараметрыЗагрузки.РасширениеФайла);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметрыЗагрузки.АдресВоВременномХранилище); //ДвоичныеДанные
	ДвоичныеДанные.Записать(ВременныйФайлЭксель);
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = ОписаниеОшибки();
   		Возврат СтруктураРезультат;
	КонецПопытки;
	
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	Эксель.Workbooks.Open(ВременныйФайлЭксель);	
	Лист = Эксель.Sheets(1);	
	
	СчетчикПустых = 0;
	МассивКарточек = Новый Массив;
	Для Сч = 12 По 100000 Цикл
		Если СчетчикПустых = 1000 тогда
			Прервать;
		КонецЕсли;
		ТекущееЗначениеКарты = Лист.Cells(Сч, 6).Value; //Номера Карт и даты 
		
		ВремяТранзакции = Лист.Cells(Сч, 5).Text;
		ДатаТранзакции = СтрокуВДату(Лист.Cells(Сч,4).Value, ВремяТранзакции);	
		 		
		НомерКарточки = СокрЛП(ТекущееЗначениеКарты);
		НомерКарточки = СтрЗаменить(НомерКарточки, Символы.НПП, "");
		Если ТипЗнч(ДатаТранзакции) <> Тип("Дата") Тогда
			СчетчикПустых = СчетчикПустых + 1;
			Продолжить;
		Иначе
			СчетчикПустых = 0;
		КонецЕсли;			
		
		ЭмитентАЗС        = Лист.Cells(Сч,2).Value;		
		КодЗаправки 	  = СокрЛП(ЭмитентАЗС);		
		
		ПродуктСтрокой = СокрЛП(Лист.Cells(Сч,7).Value);
						                                             
		Если СтрНайти(ПродуктСтрокой, "ДТ") > 0 Тогда
			КолВо  = Окр(Лист.Cells(Сч,8).Value, 2);
			Цена  = Окр(Лист.Cells(Сч,11).Value, 2);
		Иначе   
			КолВо  = Окр(Лист.Cells(Сч,8).Value, 2);
			Цена  = -Окр(Лист.Cells(Сч,11).Value, 2);
		КонецЕсли;
		 
		Если ЗначениеЗаполнено(ДатаТранзакции) Тогда		
									
			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока = НомерКарточки;
			СтруктураСтроки.Карта = СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции = ДатаТранзакции;
			СтруктураСтроки.Количество = КолВо;
			СтруктураСтроки.ПродуктСтрока = ПродуктСтрокой;
			СтруктураСтроки.Продукт = СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
			СтруктураСтроки.Цена = Цена;
			СтруктураСтроки.Сумма = Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока = КодЗаправки;
			СтруктураСтроки.МестоТранзакции = СоответствиеМестТранзакций.Получить(КодЗаправки);
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);
	
			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);		
			
		КонецЕсли;	
	КонецЦикла;
	Эксель.ActiveWorkbook.Close(Строка(0));
	Эксель.Quit();
	
	УдалитьФайлы(ВременныйФайлЭксель);
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;	
	
	Возврат СтруктураРезультат;
КонецФункции

// Получить структура загрузки транзакций по АПИ.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * Логин - Строка
// * НомерЦентра - Строка
// * НомерКонтракта - Строка
// * НомерСубКонтракта - Строка
// * Токен - Строка
// * Пароль - Строка
// * НачалоПериода - Дата
// * КонецПериода - Дата
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// Возвращаемое значение:
//  Структура - См. ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций() 
Функция ПолучитьСтруктураЗагрузкиТранзакцийПоАПИ(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций();
	
	ФорматнаяСтрокаДаты = "ДФ='yyyy-MM-ddTHH:mm:ss'";
	
	//Берлио выдает криво информацию, поэтому используем такой вот финт
	КонецПериода = КонецДня(СтруктураПараметрыЗагрузки.КонецПериода) + 1;
	КонецПериода = НачалоДня(КонецПериода);
	
	СтруктураЗамен = Новый Структура;
	СтруктураЗамен.Вставить("centerNumberParam", СтруктураПараметрыЗагрузки.НомерЦентра);
	СтруктураЗамен.Вставить("contractNumberParam", СтруктураПараметрыЗагрузки.НомерКонтракта);
	СтруктураЗамен.Вставить("contractSubNumberParam", СтруктураПараметрыЗагрузки.НомерСубКонтракта);
	СтруктураЗамен.Вставить("dateFromParam", Формат(СтруктураПараметрыЗагрузки.НачалоПериода, ФорматнаяСтрокаДаты));
	СтруктураЗамен.Вставить("dateToParam", Формат(КонецПериода, ФорматнаяСтрокаДаты));
	
	АдресАпи = АдресАПИ();
	АдресРесурса = "/api/Realisations/GetContractRealisations?centerNumber=centerNumberParam&contractNumber=contractNumberParam&contractSubNumber=contractSubNumberParam&dateFrom=dateFromParam&dateTo=dateToParam";
	
	Для Каждого КлючИЗначение Из СтруктураЗамен Цикл
		АдресРесурса = СтрЗаменить(АдресРесурса, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
	
	Попытка	
		ФлагОтладка = Ложь;
		СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
		СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок, "КодУчета");
		СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
		Если Не ФлагОтладка Тогда
		
			Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
			Запрос = Новый HTTPЗапрос(АдресРесурса);
			Запрос.Заголовки.Вставить("Token", СтруктураПараметрыЗагрузки.Токен);
			Ответ = Соединение.Получить(Запрос);
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		Иначе
			ТекстДок = Новый ТекстовыйДокумент;
			ТекстДок.Прочитать("E:\mybracho\exprovip\ТатнефтьРБ.json", КодировкаТекста.UTF8);
			ТелоОтвета = ТекстДок.ПолучитьТекст();
		КонецЕсли;			
		
		МассивТранзакций = Exprovip.ДесериалозоватьJSON(ТелоОтвета);
		
		МассивКарточек = Новый Массив;
		Для Каждого Транзакция Из МассивТранзакций Цикл
			ДатаТранзакции = Дата(Транзакция.RealisationDate);
			Если ДатаТранзакции > КонецПериода Тогда
				Продолжить;
			КонецЕсли;	

			НомерКарточки = Формат(Транзакция.RealisationCardNumber, "ЧГ=0;");
					
			Если ПустаяСтрока(НомерКарточки) Тогда
				Продолжить;
			КонецЕсли;	
			
			КодЗаправки		= Строка(Транзакция.RealisationObjectNumber);

			ПродуктСтрокой = Транзакция.RealisationProductName;	
			
			Коэффициент = 1;
			
			КолВо	= Транзакция.RealisationQuantity * Коэффициент;
			Цена	= Транзакция.RealisationRoznPrice;	

			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока				= НомерКарточки;
			СтруктураСтроки.Карта					= СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции			= ДатаТранзакции;
			СтруктураСтроки.Количество				= КолВо;
			СтруктураСтроки.ПродуктСтрока			= ПродуктСтрокой;
			СтруктураСтроки.Продукт					= СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
			СтруктураСтроки.Цена					= Цена;
			СтруктураСтроки.Сумма					= Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока	= КодЗаправки;
			СтруктураСтроки.МестоТранзакции 		= СоответствиеМестТранзакций.Получить(КодЗаправки);
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);

			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);				
				
		КонецЦикла;	
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить(ОписаниеОшибки());	
	КонецПопытки;
		
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;	
	
	//@skip-check constructor-function-return-section
	Возврат СтруктураРезультат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция АдресАПИ()
	АдресАпи = "api.cardcenter.by";
	
	Возврат АдресАпи;	
КонецФункции

// Строку в дату.
// 
// Параметры:
//  ДатаКакСтрока - Строка
//  ВремяКакСтрока - Строка
// 
// Возвращаемое значение:
//  Дата, Неопределено - Строку в дату
Функция СтрокуВДату(ДатаКакСтрока, ВремяКакСтрока)
	Результат = Неопределено;
	Попытка
		Массив = СтрРазделить(ДатаКакСтрока, ".", Ложь);
		День = Массив[0];
		Месяц = Массив[1];
		Год = Массив[2];
		
		МассивВремени = СтрРазделить(ВремяКакСтрока, ":", Ложь);
		
		Час = МассивВремени[0];
		Минута = МассивВремени[1];
		Если СтрДлина(Час) = 1 Тогда
			Час = "0"+Час;
		КонецЕсли;	
		
		ДатаСтрокой = СтрШаблон("%1%2%3%4%5%6", Год, Месяц, День, Час, Минута, "00");
		Результат = Дата(ДатаСтрокой);
	Исключение
		Результат = Неопределено;
	КонецПопытки;
	Возврат Результат;			
КонецФункции
#КонецОбласти		