
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СтруктураПараметров = Новый Структура; 
    Отбор = Новый Структура; 
    Отбор.Вставить("Скидка", ПараметрКоманды);
    СтруктураПараметров.Вставить("Отбор", Отбор); 
  
	ОткрытьФорму("РегистрСведений.ЗначенияСкидок.ФормаСписка", СтруктураПараметров, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры