// Получить структуру загрузки.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * АдресВоВременномХранилище - Строка
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// * РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Структура - Получить структуру загрузки:
// * Результат - Булево - 
// * МассивОшибок - Массив - 
// * МассивЗаправкиНеНашли - Массив - 
// * МассивСтрок - Массив из См. ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки()  
Функция ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	СтруктураРезультат.Вставить("МассивЗаправкиНеНашли", Новый Массив);
	СтруктураРезультат.Вставить("МассивСтрок", Новый Массив);
	
	ВременныйФайлЭксель = ПолучитьИмяВременногоФайла(СтруктураПараметрыЗагрузки.РасширениеФайла);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметрыЗагрузки.АдресВоВременномХранилище); //ДвоичныеДанные
	ДвоичныеДанные.Записать(ВременныйФайлЭксель);
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = ОписаниеОшибки();
   		Возврат СтруктураРезультат;
	КонецПопытки;
	
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	Эксель.Workbooks.Open(ВременныйФайлЭксель);	
	Лист = Эксель.Sheets(1);	
	
	СчетчикПустых = 0;
	МассивКарточек = Новый Массив;
	Для Сч = 5 По 100000 Цикл
		Если СчетчикПустых = 1000 тогда
			Прервать;
		КонецЕсли;
		ТекущееЗначениеКарты = Лист.Cells(Сч,1).Value; //Номера Карт и даты 
		Если СокрЛП(ТекущееЗначениеКарты) <> "" Тогда
			Карты = ТекущееЗначениеКарты;
		КонецЕсли;	
		ДатаСтрокой   = Лист.Cells(Сч,3).text;
		
		НомерКарточки = СокрЛП(Карты);
		Если Не ЗначениеЗаполнено(ДатаСтрокой) = 1 Тогда
			СчетчикПустых = СчетчикПустых+1;
			Продолжить;
		Иначе
			СчетчикПустых = 0;
		КонецЕсли;
		
		ДатаТранзакции    = Лист.Cells(Сч,3).Value;	
		ЭмитентАЗС        = Лист.Cells(Сч,17).Value;		
		КодЗаправки 	  = СокрЛП(ЭмитентАЗС);		
		
		ПродуктСтрокой = СокрЛП(Лист.Cells(Сч,4).Value);
						                                             
		Если Найти(ПродуктСтрокой,"ДТ")> 0 Тогда
			КолВо  = Окр(Лист.Cells(Сч,6).Value,2);
			Цена  = Окр(Лист.Cells(Сч,8).Value,2);//
		Иначе   
			КолВо  = Окр(Лист.Cells(Сч,6).Value,2);
			Цена  = -Окр(Лист.Cells(Сч,8).Value,2);//
		КонецЕсли;
		 
		ДатаТранзакции = Лев(ДатаТранзакции, 10);
		ДатаТранзакции = СтрЗаменить(ДатаТранзакции, "-", ".");
		Год = Лев(ДатаТранзакции, 4);
		Месяц = Сред(ДатаТранзакции, 6, 2);
		День = Прав(ДатаТранзакции, 2);		
		
		ДатаСтрокой = СтрШаблон("%1%2%3", Год, Месяц, День);
		ДатаТранзакцииДатой = Дата(ДатаСтрокой);
		
		Если ЗначениеЗаполнено(ДатаТранзакцииДатой) Тогда		
			Если СтрДлина(СокрЛП(НомерКарточки)) = 8 Тогда
				НомерКарточки = "0" + НомерКарточки;
			КонецЕсли;	
						
			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока = НомерКарточки;
			СтруктураСтроки.Карта = СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции = ДатаТранзакцииДатой;
			СтруктураСтроки.Количество = КолВо;
			СтруктураСтроки.ПродуктСтрока = ПродуктСтрокой;
			СтруктураСтроки.Продукт = СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
			СтруктураСтроки.Цена = Цена;
			СтруктураСтроки.Сумма = Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока = КодЗаправки;
			СтруктураСтроки.МестоТранзакции = СоответствиеМестТранзакций.Получить(КодЗаправки);
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);
	
			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);		
			
		КонецЕсли;	
	КонецЦикла;
	Эксель.ActiveWorkbook.Close(Строка(0));
	Эксель.Quit();
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;	
	
	Возврат СтруктураРезультат;
КонецФункции	