

#Область СлужебныеПроцедурыИФункции
// Строка в дату.
// Ожидаем строку формата: "2025-03-06 04:30:45".
// 
// Параметры:
//  СтрокаДаты - Строка
// 
// Возвращаемое значение:
//  Дата, Неопределено - Строка в дату
Функция СтрокаВДату(СтрокаДаты)
	Результат = Неопределено;
	Попытка
		Разделено = СтрРазделить(СтрокаДаты, " ");
		
		ДатаЧасть = Разделено[0];
		ВремяЧасть = Разделено[1];
		
		// Разделяем дату
		ЧастьДаты = СтрРазделить(ДатаЧасть, "-");
		
		Год = Число(ЧастьДаты[0]);
		Месяц = Число(ЧастьДаты[1]);
		День = Число(ЧастьДаты[2]);
		
		// Разделяем время
		ЧастиВремени = СтрРазделить(ВремяЧасть, ":");
		
		Час = Число(ЧастиВремени[0]);
		Минута = Число(ЧастиВремени[1]);
		Секунда = Число(ЧастиВремени[2]);
		
		// Формируем дату
		Результат = Дата(Год, Месяц, День, Час, Минута, Секунда);
	Исключение
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось конвертировать в дату строку: %1", СтрокаДаты));	
	КонецПопытки;
	Возврат Результат;
КонецФункции

// Получить токен.
// 
// Параметры:
//  СтруктураПараметров - Структура
//  * НомерКонтракта
//  * Пароль
// 
// Возвращаемое значение:
//  Структура - Получить токен:
// * Результат - Булево - 
// * Токен - Строка - 
// * МассивОшибок - Массив из Строка 
Функция ПолучитьТокен(СтруктураПараметров)
	
	СтруктураТокен = Новый Структура;
	СтруктураТокен.Вставить("Результат", Истина);
	СтруктураТокен.Вставить("Токен", "");
	СтруктураТокен.Вставить("МассивОшибок", Новый Массив);
	
	АдресАпи = "belorusneft.by/identity/connect/token";
	АдресРесурса = "";
	
	СтруктураТела = Новый Структура();
	СтруктураТела.Вставить("grant_type", "password");
	СтруктураТела.Вставить("client_id", "rcp.web");
	СтруктураТела.Вставить("client_secret", "secret");
	СтруктураТела.Вставить("scope", "rcp.api");
	СтруктураТела.Вставить("username", "020."+СтруктураПараметров.НомерКонтракта);
	СтруктураТела.Вставить("password", СтруктураПараметров.Пароль);
	
	МассивСтрок = Новый Массив;
	Для Каждого КлючИЗначение Из СтруктураТела Цикл
		СтрокаПараметров = СтрШаблон("%1=%2", КлючИЗначение.Ключ, КлючИЗначение.Значение);
		МассивСтрок.Добавить(СтрокаПараметров);
	КонецЦикла;
	
	ТелоЗапроса = СтрСоединить(МассивСтрок, "&");
	
	Попытка	
		Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			СтруктураТокен.Результат = Ложь;
			СтруктураТокен.МассивОшибок.Добавить(СтрШаблон("Код ответа: %1. Ответ: %2", Ответ.КодСостояния, ТелоОтвета));
		Иначе
			СтруктураОтвета = Exprovip.ДесериалозоватьJSON(ТелоОтвета);
			СтруктураТокен.Токен = СтруктураОтвета.access_token;
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		СтруктураТокен.Результат = Ложь;
		СтруктураТокен.МассивОшибок.Добавить(Ошибка);
	КонецПопытки;
	
	Возврат СтруктураТокен;
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получить структуру загрузки.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * АдресВоВременномХранилище - Строка
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// * РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Структура - Получить структуру загрузки:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
// * МассивЗаправкиНеНашли - Массив из Строка 
// * МассивСтрок - Массив из См. ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки()  
Функция ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = Новый Структура();
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	СтруктураРезультат.Вставить("МассивЗаправкиНеНашли", Новый Массив);
	СтруктураРезультат.Вставить("МассивСтрок", Новый Массив);
	
	//@skip-check missing-temporary-file-deletion
	ВременныйФайлЭксель = ПолучитьИмяВременногоФайла(СтруктураПараметрыЗагрузки.РасширениеФайла);
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметрыЗагрузки.АдресВоВременномХранилище); //ДвоичныеДанные
	ДвоичныеДанные.Записать(ВременныйФайлЭксель);
	
	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = ОписаниеОшибки();
   		Возврат СтруктураРезультат;
	КонецПопытки;
	
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	Эксель.Workbooks.Open(ВременныйФайлЭксель);	
	Лист = Эксель.Sheets(1);	
	
	СчетчикПустых = 0;
	МассивКарточек = Новый Массив;
	Для Сч = 5 По 100000 Цикл
		Если СчетчикПустых = 1000 тогда
			Прервать;
		КонецЕсли;
		ТекущееЗначениеКарты = Лист.Cells(Сч,1).Value; //Номера Карт и даты 
		Если СокрЛП(ТекущееЗначениеКарты) <> "" Тогда
			Карты = ТекущееЗначениеКарты;
		КонецЕсли;	
		ДатаСтрокой   = Лист.Cells(Сч,3).text;
		
		НомерКарточки = СокрЛП(Карты);
		Если Не ЗначениеЗаполнено(ДатаСтрокой) Тогда
			СчетчикПустых = СчетчикПустых + 1;
			Продолжить;
		Иначе
			СчетчикПустых = 0;
		КонецЕсли;
		
		ДатаТранзакции    = Лист.Cells(Сч,3).Value;	
		ЭмитентАЗС        = Лист.Cells(Сч,17).Value;		
		КодЗаправки 	  = СокрЛП(ЭмитентАЗС);		
		
		ПродуктСтрокой = СокрЛП(Лист.Cells(Сч,4).Value);
						                                             
		Если СтрНайти(ПродуктСтрокой,"ДТ") > 0 Тогда
			КолВо  = Окр(Лист.Cells(Сч,6).Value,2);
			Цена  = Окр(Лист.Cells(Сч,8).Value,2);//
		Иначе   
			КолВо  = Окр(Лист.Cells(Сч,6).Value,2);
			Цена  = -Окр(Лист.Cells(Сч,8).Value,2);//
		КонецЕсли;
		 
		ДатаТранзакцииДатой = СтрокаВДату(ДатаТранзакции);
		
		Если ЗначениеЗаполнено(ДатаТранзакцииДатой) Тогда		
			Если СтрДлина(СокрЛП(НомерКарточки)) = 8 Тогда
				НомерКарточки = "0" + НомерКарточки;
			КонецЕсли;	
						
			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока = НомерКарточки;
			СтруктураСтроки.Карта = СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции = ДатаТранзакцииДатой;
			СтруктураСтроки.Количество = КолВо;
			СтруктураСтроки.ПродуктСтрока = ПродуктСтрокой;
			СтруктураСтроки.Продукт = СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
			СтруктураСтроки.Цена = Цена;
			СтруктураСтроки.Сумма = Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока = КодЗаправки;
			СтруктураСтроки.МестоТранзакции = СоответствиеМестТранзакций.Получить(КодЗаправки);
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);
	
			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);		
			
		КонецЕсли;	
	КонецЦикла;
	Эксель.ActiveWorkbook.Close(Строка(0));
	Эксель.Quit();
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;	
	
	Возврат СтруктураРезультат;
КонецФункции

// Получить структура загрузки транзакций по АПИ.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * Логин - Строка
// * НомерКонтракта - Строка
// * Пароль - Строка
// * НачалоПериода - Дата
// * КонецПериода - Дата
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// Возвращаемое значение:
//  Структура - См. ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций() 
Функция ПолучитьСтруктураЗагрузкиТранзакцийПоАПИ(СтруктураПараметрыЗагрузки) Экспорт
	ЭтоТест = Ложь; //У меня нет доступа к АПИ. Читал JSON из файла
	
	СтруктураРезультат = ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций();
	
	МассивПолейДата = Новый Массив;
	МассивПолейДата.Добавить("dateTimeIssue");
	
	Если Не ЭтоТест Тогда
		СтруктураТокен = ПолучитьТокен(СтруктураПараметрыЗагрузки);
		
		Если Не СтруктураТокен.Результат Тогда
			СтруктураРезультат.Результат = Ложь;
			СтруктураРезультат.МассивОшибок = СтруктураТокен.МассивОшибок;
			
			//@skip-check constructor-function-return-section
			Возврат СтруктураРезультат;
		КонецЕсли;
		
		АдресАПИ = "ssl.beloil.by/rcp/i/api/v3/Contract/operational";
		АдресРесурса = "";
		
		СтруктураТела = Новый Структура();
		СтруктураТела.Вставить("startDate", СтруктураПараметрыЗагрузки.НачалоПериода);
		СтруктураТела.Вставить("endDate", СтруктураПараметрыЗагрузки.КонецПериода);
		СтруктураТела.Вставить("cardNumber", 0);
		СтруктураТела.Вставить("subDivisnNumber", -1);
		СтруктураТела.Вставить("flChoice", 3); //1 - топливо, 2 - оплата дорог, 4 - иные товары (услуги), 3 - топливо и оплата дорог, 5 - топливо и иные товары (услуги), 6 - оплата дорог и иные товары (услуги), 7 - топливо, оплата дорог и иные товары (услуги)
		СтруктураТела.Вставить("AzsCode", -1);
		СтруктураТела.Вставить("EmtCodeFrm", -1);
		СтруктураТела.Вставить("contractId", СтруктураПараметрыЗагрузки.НомерКонтракта);
		СтруктураТела.Вставить("contractIssuerId", "020");
		СтруктураТела.Вставить("discountCode", 0);
		
		ТелоJSON = Exprovip.СериализоватьJSON(СтруктураТела);
		
		СтруктураТранзакций = Неопределено;
		
		Попытка	
			Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
			Запрос = Новый HTTPЗапрос(АдресРесурса);
			Запрос.Заголовки.Вставить("Authorization", "Bearer "+СтруктураТокен.Токен);
			Запрос.Заголовки.Вставить("Content-Type", "application/json");
			
			Запрос.УстановитьТелоИзСтроки(ТелоJSON);
			
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
			
			Если Ответ.КодСостояния <> 200 Тогда
				СтруктураРезультат.Результат = Ложь;
				СтруктураРезультат.МассивОшибок.Добавить(СтрШаблон("Код ответа: %1. Ответ: %2", Ответ.КодСостояния, ТелоОтвета));
			Иначе
				СтруктураТранзакций = Exprovip.ДесериалозоватьJSON(ТелоОтвета, , МассивПолейДата);
			КонецЕсли;
		Исключение
			Ошибка = ОписаниеОшибки();
			СтруктураРезультат.Результат = Ложь;
			СтруктураРезультат.МассивОшибок.Добавить(Ошибка);
		КонецПопытки;
	Иначе
		//У меня нет доступа из Турции к АПИ Беларусьнефть, поэтому читаю из ДиалогВыбораФайла
		ПутьКФайлу = "E:\mybracho\exprovip\Беларусьнефть\ПримерJSON.txt";
		ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлу, КодировкаТекста.UTF8);
		ТелоОтвета = ЧтениеТекста.Прочитать();
		СтруктураТранзакций = Exprovip.ДесериалозоватьJSON(ТелоОтвета, , МассивПолейДата);		
	КонецЕсли;
	Если СтруктураТранзакций = Неопределено Тогда
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить("Не удалось десериализовать ответ API");
		Возврат СтруктураРезультат;
	КонецЕсли;
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	МассивКарточек = Новый Массив;
	
	Для Каждого ТранзакцииПоКарте Из СтруктураТранзакций.cardList Цикл
		НомерКарты = ТранзакцииПоКарте.cardNumber;
		Если СтрДлина(СокрЛП(НомерКарты)) = 8 Тогда
			НомерКарты = "0" + НомерКарты;
		КонецЕсли;	
		Для Каждого ТекущаяТранзакция Из ТранзакцииПоКарте.issueRows Цикл
			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока				= НомерКарты;
			СтруктураСтроки.Карта					= СоответствиеКарточек.Получить(НомерКарты);
			СтруктураСтроки.ДатаТранзакции			= ТекущаяТранзакция.dateTimeIssue;
			СтруктураСтроки.Количество				= ТекущаяТранзакция.productQuantity;
			СтруктураСтроки.ПродуктСтрока			= ТекущаяТранзакция.productName;
			СтруктураСтроки.Продукт					= СоответствиеНоменклатуры.Получить(ТекущаяТранзакция.productName);
			СтруктураСтроки.Цена					= ТекущаяТранзакция.productUnitPrice;
			СтруктураСтроки.Сумма					= ТекущаяТранзакция.productUnitPrice * СтруктураСтроки.Количество;
			СтруктураСтроки.МестоТранзакцииСтрока	= ТекущаяТранзакция.azsNumber;
			СтруктураСтроки.МестоТранзакции 		= СоответствиеМестТранзакций.Получить(СокрЛП(ТекущаяТранзакция.azsNumber));
			
			МассивКарточек.Добавить(СтруктураСтроки.Карта);

			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);	
		КонецЦикла;			
	КонецЦикла;
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;
	
	Возврат СтруктураРезультат;
КонецФункции
#КонецОбласти	
	