#Область СлужебныеПроцедурыИФункции
Функция АдресАПИ()
	АдресАпи = "paid-api.transitcard.ru";
	
	Возврат АдресАпи;	
КонецФункции

// Получить токен.
// 
// Параметры:
//  СтруктураПараметров - Структура
//  * Логин
//  * Пароль
// 
// Возвращаемое значение:
//  Структура - Получить токен:
// * Результат - Булево - 
// * Токен - Строка - 
// * МассивОшибок - Массив из Строка 
Функция ПолучитьТокен(СтруктураПараметров)
	
	СтруктураТокен = Новый Структура;
	СтруктураТокен.Вставить("Результат", Истина);
	СтруктураТокен.Вставить("Токен", "");
	СтруктураТокен.Вставить("МассивОшибок", Новый Массив);
		
	АдресАпи = "idp.petrolplus.ru/realms/customers/protocol/openid-connect/token";
	АдресРесурса = "";
	
	СтруктураТела = Новый Структура();
	СтруктураТела.Вставить("grant_type", "client_credentials");
	СтруктураТела.Вставить("client_id", СтруктураПараметров.Логин);
	СтруктураТела.Вставить("client_secret", СтруктураПараметров.Пароль);
		
	МассивСтрок = Новый Массив;
	Для Каждого КлючИЗначение Из СтруктураТела Цикл
		СтрокаПараметров = СтрШаблон("%1=%2", КлючИЗначение.Ключ, КлючИЗначение.Значение);
		МассивСтрок.Добавить(СтрокаПараметров);
	КонецЦикла;
	
	ТелоЗапроса = СтрСоединить(МассивСтрок, "&");
	
	Попытка	
		Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			СтруктураТокен.Результат = Ложь;
			СтруктураТокен.МассивОшибок.Добавить(СтрШаблон("Код ответа: %1. Ответ: %2", Ответ.КодСостояния, ТелоОтвета));
		Иначе
			СоответствиеОтвета = Exprovip.ДесериалозоватьJSON(ТелоОтвета, Истина);
			СтруктураТокен.Токен = СоответствиеОтвета.Получить("access_token");
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		СтруктураТокен.Результат = Ложь;
		СтруктураТокен.МассивОшибок.Добавить(Ошибка);
	КонецПопытки;
	
	Возврат СтруктураТокен;
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заблокировать карту.
// 
// Параметры:
//  Эмитент - СправочникСсылка.Контрагенты - 
//  Карта - СправочникСсылка.Карточки - 
// 
// Возвращаемое значение:
//  Структура - Заблокировать карту:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка
//@skip-check redundant-export-method
Функция ЗаблокироватьКарту(Эмитент, Карта) Экспорт
	//Пока заглушка
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	
	Возврат СтруктураРезультат;
КонецФункции

// Разблокировать карту.
// 
// Параметры:
//  Эмитент Эмитент
//  Карта Карта
// 
// Возвращаемое значение:
//  Структура - Разблокировать карту:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка
//@skip-check redundant-export-method
Функция РазблокироватьКарту(Эмитент, Карта) Экспорт
	//Пока заглушка
	
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	
	Возврат СтруктураРезультат;
КонецФункции

// Получить структуру загрузки.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * АдресВоВременномХранилище - Строка
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// * РасширениеФайла - Строка
// 
// Возвращаемое значение:
//  Структура - Получить структуру загрузки:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
// * МассивЗаправкиНеНашли - Массив из Строка 
// * МассивСтрок - Массив из См. ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки()  
Функция ПолучитьСтруктуруЗагрузки(СтруктураПараметрыЗагрузки) Экспорт
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Результат", Истина);
	СтруктураРезультат.Вставить("МассивОшибок", Новый Массив);
	СтруктураРезультат.Вставить("МассивЗаправкиНеНашли", Новый Массив);
	СтруктураРезультат.Вставить("МассивСтрок", Новый Массив);

	ВременныйФайлЭксель = ПолучитьИмяВременногоФайла(СтруктураПараметрыЗагрузки.РасширениеФайла);

	ДвоичныеДанные = ПолучитьИзВременногоХранилища(СтруктураПараметрыЗагрузки.АдресВоВременномХранилище); //ДвоичныеДанные
	ДвоичныеДанные.Записать(ВременныйФайлЭксель);

	Попытка
		Эксель = Новый COMОбъект("Excel.Application");
		Эксель.DisplayAlerts = 0;
		Эксель.Visible = 0;
	Исключение
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = ОписаниеОшибки();
		Возврат СтруктураРезультат;
	КонецПопытки;

	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(
		СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);

	Эксель.Workbooks.Open(ВременныйФайлЭксель);
	Лист = Эксель.Sheets(1);

	СчетчикПустых = 0;
	МассивКарточек = Новый Массив;
	Для Сч = 4 По 100000 Цикл
		Если СчетчикПустых = 1000 Тогда
			Прервать;
		КонецЕсли;
		ТекущееЗначениеКарты = Лист.Cells(Сч, 3).Value;

		НомерКарточки = СокрЛП(ТекущееЗначениеКарты);
		НомерКарточки = СтрЗаменить(НомерКарточки, Символы.НПП, "");
		Если Не ЗначениеЗаполнено(НомерКарточки) Тогда
			СчетчикПустых = СчетчикПустых + 1;
			Продолжить;
		Иначе
			СчетчикПустых = 0;
		КонецЕсли;

		ДатаТранзакции    = Лист.Cells(Сч, 1).Value;
		ЭмитентАЗС        = Лист.Cells(Сч, 15).Value;
		ЛокальныйНомерАЗС = Лист.Cells(Сч, 16).Value;

		ЭмитентАЗС = СтрЗаменить(ЭмитентАЗС, Символы.НПП, "");
		ЛокальныйНомерАЗС = СтрЗаменить(ЛокальныйНомерАЗС, Символы.НПП, "");
		
		КодЗаправки = СтрШаблон("%1,%2", СокрЛП(ЭмитентАЗС), СокрЛП(ЛокальныйНомерАЗС));

		ПродуктСтрокой = СокрЛП(Лист.Cells(Сч, 6).Value);

		Если ПродуктСтрокой <> "Оплата дор" Тогда
			КолВо  = Окр(Лист.Cells(Сч, 7).Value, 2);
			Цена  = Окр(Лист.Cells(Сч, 10).Value, 2);
		Иначе
			КолВо  = Окр(Лист.Cells(Сч, 7).Value, 2);
			Цена  = -Окр(Лист.Cells(Сч, 10).Value, 2);
		КонецЕсли;

		ДатаТранзакцииДатой = ДатаТранзакции;

		Если ЗначениеЗаполнено(ДатаТранзакцииДатой) Тогда

			СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
			СтруктураСтроки.КартаСтрока = НомерКарточки;
			СтруктураСтроки.Карта = СоответствиеКарточек.Получить(НомерКарточки);
			СтруктураСтроки.ДатаТранзакции = ДатаТранзакцииДатой;
			СтруктураСтроки.Количество = КолВо;
			СтруктураСтроки.ПродуктСтрока = ПродуктСтрокой;
			СтруктураСтроки.Продукт = СоответствиеНоменклатуры.Получить(ПродуктСтрокой);
			СтруктураСтроки.Цена = Цена;
			СтруктураСтроки.Сумма = Цена * КолВо;
			СтруктураСтроки.МестоТранзакцииСтрока = КодЗаправки;
			СтруктураСтроки.МестоТранзакции = СоответствиеМестТранзакций.Получить(КодЗаправки);

			МассивКарточек.Добавить(СтруктураСтроки.Карта);

			СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);

		КонецЕсли;
	КонецЦикла;
	Эксель.ActiveWorkbook.Close(Строка(0));
	Эксель.Quit();
	
	УдалитьФайлы(ВременныйФайлЭксель);

	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);
	КонецЦикла;

	Возврат СтруктураРезультат;
КонецФункции

// Получить структура загрузки транзакций по АПИ.
// 
// Параметры:
//  СтруктураПараметрыЗагрузки - Структура:
// * Логин - Строка
// * НомерКонтракта - Строка
// * Пароль - Строка
// * НачалоПериода - Дата
// * КонецПериода - Дата
// * ПапкаЗаправок - СправочникСсылка.МестаТранзакции 
// * РеквизитПоискаНоменклатуры - Строка
// Возвращаемое значение:
//  Структура - См. ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций() 
Функция ПолучитьСтруктураЗагрузкиТранзакцийПоАПИ(СтруктураПараметрыЗагрузки) Экспорт
		
	СтруктураРезультат = ЗагрузкаОбщий.СтруктураДанныхЗагрузкиТранзакций();
	
	МассивПолейДата = Новый Массив;
	МассивПолейДата.Добавить("contractDate");
	МассивПолейДата.Добавить("date");
	МассивПолейДата.Добавить("dateRec");
	МассивПолейДата.Добавить("dateReg");
	
	СтруктураПараметровТокен = Новый Структура;
	СтруктураПараметровТокен.Вставить("client_id", СтруктураПараметрыЗагрузки.Логин);
	СтруктураПараметровТокен.Вставить("client_secret", СтруктураПараметрыЗагрузки.Пароль);
	СтруктураТокен = ПолучитьТокен(СтруктураПараметрыЗагрузки);
	
	Если Не СтруктураТокен.Результат Тогда
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок = СтруктураТокен.МассивОшибок;
		
		//@skip-check constructor-function-return-section
		Возврат СтруктураРезультат;
	КонецЕсли;
	ФорматнаяСтрокаДаты = "ДФ=yyyy-MM-dd";
	
	СтруктураЗамен = Новый Структура;
	СтруктураЗамен.Вставить("queryDateFrom", Формат(СтруктураПараметрыЗагрузки.НачалоПериода, ФорматнаяСтрокаДаты));
	СтруктураЗамен.Вставить("queryDateTo", Формат(СтруктураПараметрыЗагрузки.КонецПериода, ФорматнаяСтрокаДаты));
	
	АдресАПИ = АдресАПИ();
	АдресРесурса = "transactions?dateFrom=queryDateFrom&dateTo=queryDateTo";
		
	Для Каждого КлючИЗначение Из СтруктураЗамен Цикл
		АдресРесурса = СтрЗаменить(АдресРесурса, КлючИЗначение.Ключ, КлючИЗначение.Значение);
	КонецЦикла;
		
	СтруктураТранзакций = Неопределено;
	
	Попытка	
		Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.Заголовки.Вставить("Authorization", "Bearer "+СтруктураТокен.Токен);
		Запрос.Заголовки.Вставить("Accept", "application/json");
		
		Ответ = Соединение.Получить(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			СтруктураРезультат.Результат = Ложь;
			СтруктураРезультат.МассивОшибок.Добавить(СтрШаблон("Код ответа: %1. Ответ: %2", Ответ.КодСостояния, ТелоОтвета));
		Иначе
			СтруктураТранзакций = Exprovip.ДесериалозоватьJSON(ТелоОтвета, , МассивПолейДата);
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить(Ошибка);
	КонецПопытки;
	
	Если СтруктураТранзакций = Неопределено Тогда
		СтруктураРезультат.Результат = Ложь;
		СтруктураРезультат.МассивОшибок.Добавить("Не удалось десериализовать ответ API");
		Возврат СтруктураРезультат;
	КонецЕсли;
	СоответствиеКарточек = ЗагрузкаОбщий.СоответствиеКарточек();
	СоответствиеМестТранзакций = ЗагрузкаОбщий.СоответствиеМестТранзакций(СтруктураПараметрыЗагрузки.ПапкаЗаправок);
	СоответствиеНоменклатуры = ЗагрузкаОбщий.СоответсвиеНоменклатуры(СтруктураПараметрыЗагрузки.РеквизитПоискаНоменклатуры);
	
	МассивКарточек = Новый Массив;
	
	Для Каждого ТранзакцииПоКарте Из СтруктураТранзакций.transactions Цикл
		НомерКарты = Формат(ТранзакцииПоКарте.cardNum, "ЧГ=0");
		
		СтруктураСтроки = ЗагрузкаОбщий.СтруктураСтрокиЭксельДляЗагрузки();
		СтруктураСтроки.КартаСтрока				= НомерКарты;
		СтруктураСтроки.Карта					= СоответствиеКарточек.Получить(НомерКарты);
		СтруктураСтроки.ДатаТранзакции			= ТранзакцииПоКарте.date;
		СтруктураСтроки.Количество				= ТранзакцииПоКарте.amount;
		СтруктураСтроки.ПродуктСтрока			= ТранзакцииПоКарте.serviceName;
		СтруктураСтроки.Продукт					= СоответствиеНоменклатуры.Получить(ТранзакцииПоКарте.serviceName);
		СтруктураСтроки.Цена					= ТранзакцииПоКарте.Price;
		СтруктураСтроки.Сумма					= ТранзакцииПоКарте.Price * СтруктураСтроки.Количество;
		СтруктураСтроки.МестоТранзакцииСтрока	= СтрШаблон("%1,%2", Формат(ТранзакцииПоКарте.idEmitPos, "ЧГ=0"), Формат(ТранзакцииПоКарте.posNumber, "ЧГ=0"));
		СтруктураСтроки.МестоТранзакции 		= СоответствиеМестТранзакций.Получить(СокрЛП(СтруктураСтроки.МестоТранзакцииСтрока));
		
		МассивКарточек.Добавить(СтруктураСтроки.Карта);

		СтруктураРезультат.МассивСтрок.Добавить(СтруктураСтроки);	
		
	КонецЦикла;
	
	СоответствиеВладельцевКарт = ЗагрузкаОбщий.СоответствиеВладельцевКарт(МассивКарточек);
	СоответствиеАвтомобилейКарт = ЗагрузкаОбщий.СоответствиеАвтомобилейКарт(МассивКарточек);
	Для Каждого СтруктураМассива Из СтруктураРезультат.МассивСтрок Цикл
		СтруктураМассива.Клиент = СоответствиеВладельцевКарт.Получить(СтруктураМассива.Карта);
		СтруктураМассива.Автомобиль = СоответствиеАвтомобилейКарт.Получить(СтруктураМассива.Карта);		
	КонецЦикла;
	
	Возврат СтруктураРезультат;
КонецФункции
#КонецОбласти