
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	ДвиженияВзаиморасчетыПоставщики();	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияВзаиморасчетыПоставщики()
	Движения.ВзаиморасчетыПоставщики.Записывать = Истина;
	Для Каждого ТекСтрокаОплаты из Оплаты Цикл
		Движение = Движения.ВзаиморасчетыПоставщики.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Контрагент = ТекСтрокаОплаты.Контрагент;
		Движение.Валюта = ТекСтрокаОплаты.Валюта;
		Движение.Сумма = МодульЧисла(ТекСтрокаОплаты.Сумма);
		Движение.СуммаВалютная = МодульЧисла(ТекСтрокаОплаты.СуммаВалютная);
		Движение.ДатаТранзакции = Дата;
	КонецЦикла;
КонецПроцедуры

Функция МодульЧисла(ВходящееЧисло)
	Если ВходящееЧисло < 0 Тогда
		Возврат -ВходящееЧисло;
	Иначе
		Возврат ВходящееЧисло;
	КонецЕсли;		
КонецФункции

#КонецОбласти	

#КонецЕсли

