
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выгрузить транзакции.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьТранзакции(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	МассивФактур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Фактура");
	
	JSON = Exprovip.МассивТранзакцийФактуре(МассивФактур);
	
	Настройки = Справочники.Настройки.ПолучитьНастройки();
	
	Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
		ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
	КонецЕсли;
	ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "transactions", "json");		
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.УстановитьТекст(JSON);
	ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
	
КонецПроцедуры

// Выгрузить фактуры.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьФактуры(НачалоПериода, КонецПериода) Экспорт
	МассивСтруктур = Новый Массив(); //Массив из См. ШаблонСтруктурыФактурыДляПечати()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТаблицаПечати = ТаблицаПечатиШаблон();
		ТаблицаДанные = ТаблицаДанныеШаблон();

		ФактураОбъект = Выборка.Фактура.ПолучитьОбъект();
		СтруктураПечати = Документы.Фактура.ПолучитьСтруктуруПечати(ФактураОбъект);

		Документы.Фактура.ЗаполнитьТаблицуПечати(СтруктураПечати, ТаблицаПечати);
		Документы.Фактура.ЗаполнитьТаблицаДанные(СтруктураПечати, ТаблицаДанные);
		
		Счетчик = 0;
		
		Для Каждого СтрокаТЧ Из ТаблицаПечати Цикл
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
			
			Счетчик = Счетчик + 1;
			Если Счетчик >= 2 Тогда
				Прервать;
			КонецЕсли;	
			
			//@skip-check query-in-loop
			Структура = ПолучитьТабличныйДокумент(
				СтрокаТЧ.Контрагент,
				СтрокаТЧ.ЭтапОплаты,
				СтрокаТЧ.НомерФактуры,
				ТаблицаДанные,
				Выборка.Фактура);
			ТабличныйДокумент = Структура.ТабличныйДокумент;
			ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
						
			СтруктураТекущейФактуры = ШаблонСтруктурыФактурыДляПечати();
			СтруктураТекущейФактуры.Number = Структура.НомерФактуры;
			СтруктураТекущейФактуры.Date = Структура.ДатаФактуры;
			СтруктураТекущейФактуры.Currency = СокрЛП(Структура.ВалютаФактуры);
			СтруктураТекущейФактуры.Amount = Структура.СуммаФактуры;
			СтруктураТекущейФактуры.Metadata = Base64Строка(ДвоичныеДанные);
			
			МассивСтруктур.Добавить(СтруктураТекущейФактуры);
			
			Попытка
				УдалитьФайлы(ИмяВременногоФайла);	
			Исключение
				ЗаписьЖурналаРегистрации("ОбменССайтом", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			КонецПопытки;			
		КонецЦикла;		
	КонецЦикла;	
	
	Если МассивСтруктур.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивСтруктур);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
			ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
		КонецЕсли;
		ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "invoices", "json");		
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.УстановитьТекст(JSON);
		ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутсвуют фактуры для передачи на сайт");
	КонецЕсли;	
КонецПроцедуры

// Выгрузить клиентов.
Процедура ВыгрузитьКлиентов() Экспорт
	МассивКлиентов = Новый Массив; //См. ШаблонСтруктурыКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Код,
	|	Карточки.Наименование КАК НомерКарты,
	|	Карточки.Владелец КАК Контрагент,
	|	Карточки.Блокировка,
	|	Карточки.Архивная
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	НЕ Карточки.ПометкаУдаления
	|	И Карточки.Владелец.Активный
	|ИТОГИ
	|ПО
	|	Контрагент";
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока ВыборкаКонтрагент.Следующий() Цикл
		СтруктураИнформацииКонтрагент = Справочники.Контрагенты.ПолучитьРеквизитыКлиента(ВыборкаКонтрагент.Контрагент, ТекущаяДатаСеанса());
	
		СтруктураТекущегоКонтрагента = ШаблонСтруктурыКлиента();
		СтруктураТекущегоКонтрагента.Name = СтруктураИнформацииКонтрагент.НазваниеКлиента;
		СтруктураТекущегоКонтрагента.Phone = СтруктураИнформацииКонтрагент.Телефон;
		СтруктураТекущегоКонтрагента.Discount = СокрЛП(СтруктураИнформацииКонтрагент.Тариф);
		СтруктураТекущегоКонтрагента.Email = СтруктураИнформацииКонтрагент.Email;
		ВыборкаКарты = ВыборкаКонтрагент.Выбрать();
		Пока ВыборкаКарты.Следующий() Цикл
		
			СтруктураТекущейКарты = ШаблонСтруктурыКарты();
			СтруктураТекущейКарты.CardNumber = ВыборкаКарты.НомерКарты;
			СтруктураТекущейКарты.IsBlocked = ВыборкаКарты.Блокировка;
			
			СтруктураТекущегоКонтрагента.Cards.Добавить(СтруктураТекущейКарты);
		КонецЦикла;	
		
		МассивКлиентов.Добавить(СтруктураТекущегоКонтрагента);
	КонецЦикла;	
	
	Если МассивКлиентов.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивКлиентов);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
			ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
		КонецЕсли;
		ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "users", "json");		
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.УстановитьТекст(JSON);
		ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют пользователи для передачи на сайт");
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Таблица печати шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица печати шаблон:
// * Выбран - Булево - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * НомерФактуры - Число - 
// * ЭтапОплаты - Число - 
Функция ТаблицаПечатиШаблон()
	ТаблицаПечати = Новый ТаблицаЗначений();
	ТаблицаПечати.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	ТаблицаПечати.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаПечати.Колонки.Добавить("НомерФактуры", Новый ОписаниеТипов("Число"));
	ТаблицаПечати.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаПечати;
КонецФункции

// Таблица данные шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица данные шаблон:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
Функция ТаблицаДанныеШаблон()
	ТаблицаДанные = Новый ТаблицаЗначений();
	ТаблицаДанные.Колонки.Добавить("ДатаТранзакции", Новый ОписаниеТипов("Дата"));
	ТаблицаДанные.Колонки.Добавить("Карта", Новый ОписаниеТипов("СправочникСсылка.Карточки"));
	ТаблицаДанные.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанные.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДанные.Колонки.Добавить("МестоТранзакции", Новый ОписаниеТипов("СправочникСсылка.МестаТранзакции"));
	ТаблицаДанные.Колонки.Добавить("Продукт", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Итого", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДанные.Колонки.Добавить("Скидка", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЦенаСоСкидкой", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаДанные;
КонецФункции

// Получить табличный документ.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты - Контрагент ссылка
//  ЭтапОплаты - Число - Этап оплаты
//  НомерФактуры - Число - Номер фактуры
//  ТаблицаДанные - ТаблицаЗначений - Таблица данные:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
//  ФактураСсылка - ДокументСсылка.Фактура
// 
// Возвращаемое значение:
//  Структура - Получить табличный документ:
// * ТабличныйДокумент - ТабличныйДокумент - 
// * ИмяФайла - Строка - 
// * НомерФактуры - Строка - 
// * ДатаФактуры - Дата - 
Функция ПолучитьТабличныйДокумент(КонтрагентСсылка, ЭтапОплаты, НомерФактуры, ТаблицаДанные, ФактураСсылка)
	ТаблицаДанныеВременная = ТаблицаДанные;
	
	Возврат Документы.Фактура.СтруктураФактурыКлиента(
		КонтрагентСсылка,
		ЭтапОплаты,
		НомерФактуры,
		ФактураСсылка,
		ТаблицаДанныеВременная);
КонецФункции

// Шаблон структуры фактуры для печати.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры фактуры для печати:
// * Date - Строка - 
// * Number - Строка - 
// * Currency - Строка - 
// * Amount - Строка - 
// * Metadata - Строка - 
Функция ШаблонСтруктурыФактурыДляПечати()
	Структура = Новый Структура();
	Структура.Вставить("Date", "");
	Структура.Вставить("Number", "");
	Структура.Вставить("Currency", "");
	Структура.Вставить("Amount", "");
	Структура.Вставить("Metadata", "");
	
	Возврат Структура;
КонецФункции

// Шаблон структуры клиента.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры клиента:
// * Name - Строка - 
// * Phone - Строка - 
// * Email - Строка - 
// * Discount - Строка - 
// * Cards - Массив из См. ШаблонСтруктурыКарты() 
Функция ШаблонСтруктурыКлиента()
	Структура = Новый Структура();
	Структура.Вставить("Name", "");
	Структура.Вставить("Phone", "");
	Структура.Вставить("Email", "");
	Структура.Вставить("Discount", "");
	Структура.Вставить("Cards", Новый Массив); //См. ШаблонСтруктурыКарты()
	
	Возврат Структура;
КонецФункции

// Шаблон структуры карты.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры карты:
// * CardNumber - Строка
// * IsBlocked - Строка
Функция ШаблонСтруктурыКарты()
	Структура = Новый Структура();
	Структура.Вставить("CardNumber", "");
	Структура.Вставить("IsBlocked", "");
	
	Возврат Структура;	
КонецФункции	
#КонецОбласти

#КонецЕсли