
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выгрузить транзакции.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьТранзакции(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	МассивФактур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Фактура");
				
	JSON = МассивТранзакцийФактуре(МассивФактур);
	
	Настройки = Справочники.Настройки.ПолучитьНастройки();
	
	Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
		ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
	КонецЕсли;
	ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "transactions", "json");		
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.УстановитьТекст(JSON);
	ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
	
КонецПроцедуры

// Выгрузить фактуры.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
//  ВариантОбменаССайтом - ПеречислениеСсылка.ВариантыОбменаССайтом
Процедура ВыгрузитьФактуры(НачалоПериода, КонецПериода, ВариантОбменаССайтом) Экспорт
	ИмяСобытия = "Отправка фактур на сайт";
	
	Если Не ЗначениеЗаполнено(ВариантОбменаССайтом) Тогда
		ТекстСообщения = "Не указан вариант обмена с сайтом";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);		
	КонецЕсли;
	
	МассивСтруктур = Новый Массив(); //Массив из См. ШаблонСтруктурыФактурыДляПечати()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	РазмерПорции = 5;
	СчетчикВыгрузок = 0;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТаблицаПечати = ТаблицаПечатиШаблон();
		ТаблицаДанные = ТаблицаДанныеШаблон();

		ФактураОбъект = Выборка.Фактура.ПолучитьОбъект();
		СтруктураПечати = Документы.Фактура.ПолучитьСтруктуруПечати(ФактураОбъект);

		Документы.Фактура.ЗаполнитьТаблицуПечати(СтруктураПечати, ТаблицаПечати);
		Документы.Фактура.ЗаполнитьТаблицаДанные(СтруктураПечати, ТаблицаДанные);
		
		Счетчик = 0;
		
		Для Каждого СтрокаТЧ Из ТаблицаПечати Цикл
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
			
			Счетчик = Счетчик + 1;
			Если Счетчик >= 2 Тогда
				//Прервать;
			КонецЕсли;	
			
			//@skip-check query-in-loop
			Структура = ПолучитьТабличныйДокумент(
				СтрокаТЧ.Контрагент,
				СтрокаТЧ.ЭтапОплаты,
				СтрокаТЧ.НомерФактуры,
				ТаблицаДанные,
				Выборка.Фактура);
			ТабличныйДокумент = Структура.ТабличныйДокумент;
			ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
						
			СтруктураТекущейФактуры = ШаблонСтруктурыФактурыДляПечати();
			СтруктураТекущейФактуры.UserID = XMLСтрока(СтрокаТЧ.Контрагент);
			СтруктураТекущейФактуры.Number = Структура.НомерФактуры;
			СтруктураТекущейФактуры.Date = Структура.ДатаФактуры;
			СтруктураТекущейФактуры.Currency = СокрЛП(Структура.ВалютаФактуры);
			СтруктураТекущейФактуры.Amount = Структура.СуммаФактуры;
			СтруктураТекущейФактуры.Metadata = Base64Строка(ДвоичныеДанные);
			
			МассивСтруктур.Добавить(СтруктураТекущейФактуры);			
			
			Попытка
				УдалитьФайлы(ИмяВременногоФайла);	
			Исключение
				ЗаписьЖурналаРегистрации("ОбменССайтом", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			КонецПопытки;
					
			Если МассивСтруктур.Количество() = РазмерПорции Тогда
				СчетчикВыгрузок = СчетчикВыгрузок + 1;
				ВыгрузитьДанныеФактурНаСайт(МассивСтруктур, ВариантОбменаССайтом, СчетчикВыгрузок);
				МассивСтруктур.Очистить();
			КонецЕсли;			
		КонецЦикла;		
	КонецЦикла;
	Если МассивСтруктур.Количество() Тогда
		СчетчикВыгрузок = СчетчикВыгрузок + 1;
		ВыгрузитьДанныеФактурНаСайт(МассивСтруктур, ВариантОбменаССайтом, СчетчикВыгрузок);		
	КонецЕсли;
КонецПроцедуры

// Удалить данные.
// 
// Параметры:
//  ИмяТаблицы - Строка
//  ДатаНачала - Дата
//  ДатаОкончания - Дата
Процедура УдалитьДанные(ИмяТаблицы, ДатаНачала, ДатаОкончания) Экспорт
	ИмяСобытия = "Удаление данных с сайта";
	
	Структура = Новый Структура();
	Структура.Вставить("table", ИмяТаблицы);
	Структура.Вставить("date_from", ДатаНачала);
	Структура.Вставить("date_to", КонецДня(ДатаОкончания));
	
	JSON = Exprovip.СериализоватьJSON(Структура);
	
	Настройки = Справочники.Настройки.ПолучитьНастройки();
	
	СтруктураAPI = Новый Структура();
	СтруктураAPI.Вставить("АдресAPI", Настройки.APIСайтДляВыгрузкиДанных);
	СтруктураAPI.Вставить("РесурсAPI", Настройки.APIРесурсУдалениеДанных);
	СтруктураОтветаСайта = ПередатьДанныеНаСайт(JSON, СтруктураAPI);
	Если Не СтруктураОтветаСайта.Результат Тогда
		ТекстСообщения = СтрСоединить(СтруктураОтветаСайта.МассивОшибок);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);	
	КонецЕсли;
КонецПроцедуры	

// Удалить карты клиентов.
// 
// Параметры:
//  МассивКлиентов - Массив из СправочникСсылка.Контрагенты
Процедура УдалитьКартыКлиентов(МассивКлиентов = Неопределено) Экспорт
	ИмяСобытия = "Удаление данных по карточкам";
	
	МассивИДКлиентов = Новый Массив;
	
	Если МассивКлиентов <> Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("МассивКлиентов", МассивКлиентов);
		Запрос.Текст = "ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Контрагенты.Ссылка)) КАК ИДКлиента
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.Ссылка В (&МассивКлиентов)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Соответствие = Новый Соответствие();
			Соответствие.Вставить("1c_id", Выборка.ИДКлиента);
			
			МассивИДКлиентов.Добавить(Соответствие);
		КонецЦикла;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Карточки.Владелец) КАК ИДКлиента
		|ИЗ
		|	Справочник.Карточки КАК Карточки
		|ГДЕ
		|	НЕ Карточки.ПометкаУдаления
		|	И Карточки.Владелец.Активный
		|	И НЕ Карточки.Архивная
		|СГРУППИРОВАТЬ ПО
		|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Карточки.Владелец)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Соответствие = Новый Соответствие();
			Соответствие.Вставить("1c_id", Строка(Выборка.ИДКлиента));
			
			МассивИДКлиентов.Добавить(Соответствие);
		КонецЦикла;			
	КонецЕсли;
	
	JSON = Exprovip.СериализоватьJSON(МассивИДКлиентов);
	
	Настройки = Справочники.Настройки.ПолучитьНастройки();
	
	СтруктураAPI = Новый Структура();
	СтруктураAPI.Вставить("АдресAPI", Настройки.APIСайтДляВыгрузкиДанных);
	СтруктураAPI.Вставить("РесурсAPI", Настройки.APIРесурсУдалениеКарточек);
	СтруктураОтветаСайта = ПередатьДанныеНаСайт(JSON, СтруктураAPI);
	Если Не СтруктураОтветаСайта.Результат Тогда
		ТекстСообщения = СтрСоединить(СтруктураОтветаСайта.МассивОшибок);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);	
	КонецЕсли;		 	
КонецПроцедуры	

// @skip-check module-structure-method-in-regions
// 
// Параметры:
//  МассивСтруктур - Массив из Структура
//  ВариантОбменаССайтом - ПеречислениеСсылка.ВариантыОбменаССайтом
//  ПостфиксФайла - Число
Процедура ВыгрузитьДанныеФактурНаСайт(МассивСтруктур, ВариантОбменаССайтом, ПостфиксФайла)
	ИмяСобытия = "Отправка фактур на сайт";
	Если МассивСтруктур.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивСтруктур);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		Если ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.ПапкаНаДиске Тогда		
			Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
				ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
			КонецЕсли;
			ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, СтрШаблон("invoices_%1", ПостфиксФайла), "json");		
			ТекстовыйДокумент = Новый ТекстовыйДокумент();
			ТекстовыйДокумент.УстановитьТекст(JSON);
			ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
		ИначеЕсли ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.API Тогда
			СтруктураAPI = Новый Структура();
			СтруктураAPI.Вставить("АдресAPI", Настройки.APIСайтДляВыгрузкиДанных);
			СтруктураAPI.Вставить("РесурсAPI", Настройки.APIРесурсВыгрузкиФактуры);
			СтруктураОтветаСайта = ПередатьДанныеНаСайт(JSON, СтруктураAPI);
			Если Не СтруктураОтветаСайта.Результат Тогда
				ТекстСообщения = СтрСоединить(СтруктураОтветаСайта.МассивОшибок);
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				ВызватьИсключение(ТекстСообщения);	
			КонецЕсли;
		Иначе
			ТекстСообщения = СтрШаблон("Незвестный вариант обмена с сайтом: %1", ВариантОбменаССайтом);
			ВызватьИсключение(ТекстСообщения);
		КонецЕсли;			
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют фактуры для передачи на сайт");
	КонецЕсли;
КонецПроцедуры	

// Выгрузить клиентов.
// 
// Параметры:
//  ВариантОбменаССайтом - ПеречислениеСсылка.ВариантыОбменаССайтом
Процедура ВыгрузитьКлиентов(ВариантОбменаССайтом) Экспорт
	ИмяСобытия = "Отправка клиентов на сайт";
	
	Если Не ЗначениеЗаполнено(ВариантОбменаССайтом) Тогда
		ТекстСообщения = "Не указан вариант обмена с сайтом";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);		
	КонецЕсли;	
	
	МассивКлиентов = Новый Массив; //См. ШаблонСтруктурыКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Код КАК Код,
	|	Карточки.Наименование КАК НомерКарты,
	|	Карточки.Владелец КАК Контрагент,
	|	Карточки.Блокировка КАК Блокировка,
	|	Карточки.Архивная КАК Архивная,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Карточки.Владелец) КАК ИДКонтрагента,
	|	ЕСТЬNULL(КонтрагентыЛимитыПоКартам.Продукт.Наименование, """""""") КАК Продукт,
	|	ЕСТЬNULL(КонтрагентыЛимитыПоКартам.ЛимитВМесяц, 0) КАК ЛимитВМесяц,
	|	ЕСТЬNULL(КонтрагентыЛимитыПоКартам.ЛимитВДень, 0) КАК ЛимитВДень,
	|	Карточки.Эмитент КАК Эмитент
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ЛимитыПоКартам КАК КонтрагентыЛимитыПоКартам
	|		ПО Карточки.Владелец = КонтрагентыЛимитыПоКартам.Ссылка
	|		И Карточки.Эмитент = КонтрагентыЛимитыПоКартам.Эмитент
	|ГДЕ
	|	НЕ Карточки.ПометкаУдаления
	|	И Карточки.Владелец.Активный
	|	И НЕ Карточки.Архивная
	|ИТОГИ
	|	МАКСИМУМ(Код),
	|	МАКСИМУМ(Блокировка),
	|	МАКСИМУМ(Архивная),
	|	МАКСИМУМ(ИДКонтрагента),
	|	СУММА(ЛимитВМесяц),
	|	СУММА(ЛимитВДень),
	|	МАКСИМУМ(Эмитент)
	|ПО
	|	Контрагент,
	|	НомерКарты";
	
	МассивКритическихОшибок = Новый Массив;
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока ВыборкаКонтрагент.Следующий() Цикл
		СтруктураИнформацииКонтрагент = Справочники.Контрагенты.ПолучитьРеквизитыКлиента(ВыборкаКонтрагент.Контрагент, ТекущаяДатаСеанса());
	
		СтруктураТекущегоКонтрагента = ШаблонСтруктурыКлиента();
		СтруктураТекущегоКонтрагента.Name = СтруктураИнформацииКонтрагент.НазваниеКлиента;
		СтруктураТекущегоКонтрагента.UserID = XMLСтрока(ВыборкаКонтрагент.ИДКонтрагента);
		СтруктураТекущегоКонтрагента.Phone = СтруктураИнформацииКонтрагент.Телефон;
		СтруктураТекущегоКонтрагента.Discount = СокрЛП(СтруктураИнформацииКонтрагент.Тариф);
		СтруктураТекущегоКонтрагента.Email = СтруктураИнформацииКонтрагент.Логин;
		
		Если ПустаяСтрока(СтруктураИнформацииКонтрагент.Email) Тогда
			МассивКритическихОшибок.Добавить(СтрШаблон("У клиента %1 не заполнен email. Выгрузка прервана", СтруктураИнформацииКонтрагент.НазваниеКлиента));
		КонецЕсли;
		Если ПустаяСтрока(СтруктураИнформацииКонтрагент.Телефон) Тогда
			МассивКритическихОшибок.Добавить(СтрШаблон("У клиента %1 не указан телефон. Выгрузка прервана", СтруктураИнформацииКонтрагент.НазваниеКлиента));
		КонецЕсли;
		
		ВыборкаКарты = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерКарты");
		Пока ВыборкаКарты.Следующий() Цикл
		
			СтруктураТекущейКарты = ШаблонСтруктурыКарты();
			СтруктураТекущейКарты.CardNumber = ВыборкаКарты.НомерКарты;
			СтруктураТекущейКарты.IsBlocked = ВыборкаКарты.Блокировка;
			СтруктураТекущейКарты.TotalLimit = "неограничено";
			
			Если ВыборкаКарты.ЛимитВМесяц <> 0 ИЛИ ВыборкаКарты.ЛимитВДень <> 0 Тогда
				ВыборкаЛимиты = ВыборкаКарты.Выбрать();
				Пока ВыборкаЛимиты.Следующий() Цикл				
					СтруктураЛимита = ШаблонСтруктураЛимита();
					СтруктураЛимита.Product = ВыборкаЛимиты.Продукт;
					СтруктураЛимита.LimitPerDay = ВыборкаЛимиты.ЛимитВДень;
					СтруктураЛимита.LimitPerMonth = ВыборкаЛимиты.ЛимитВМесяц;
					СтруктураТекущейКарты.Limits.Добавить(СтруктураЛимита);
				КонецЦикла;
			КонецЕсли;		
			
			СтруктураТекущегоКонтрагента.Cards.Добавить(СтруктураТекущейКарты);
		КонецЦикла;	
		
		МассивКлиентов.Добавить(СтруктураТекущегоКонтрагента);
	КонецЦикла;	
	
	Если МассивКритическихОшибок.Количество() > 0 Тогда
		ТекстСообщения = СтрСоединить(МассивКритическихОшибок, Символы.ПС);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);
	КонецЕсли;
	
	Если МассивКлиентов.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивКлиентов);
		
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		Если ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.ПапкаНаДиске Тогда		
			Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
				ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
			КонецЕсли;
			ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "users", "json");		
			ТекстовыйДокумент = Новый ТекстовыйДокумент();
			ТекстовыйДокумент.УстановитьТекст(JSON);
			ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
		ИначеЕсли ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.API Тогда
			СтруктураAPI = Новый Структура();
			СтруктураAPI.Вставить("АдресAPI", Настройки.APIСайтДляВыгрузкиДанных);
			СтруктураAPI.Вставить("РесурсAPI", Настройки.APIРесурсВыгрузкиКлиентов);
			СтруктураОтветаСайта = ПередатьДанныеНаСайт(JSON, СтруктураAPI);
			Если Не СтруктураОтветаСайта.Результат Тогда
				ТекстСообщения = СтрСоединить(СтруктураОтветаСайта.МассивОшибок);
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				ВызватьИсключение(ТекстСообщения);	
			КонецЕсли;
		Иначе
			ТекстСообщения = СтрШаблон("Незвестный вариант обмена с сайтом: %1", ВариантОбменаССайтом);
			ВызватьИсключение(ТекстСообщения);			
		КонецЕсли;		
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют пользователи для передачи на сайт");
	КонецЕсли;	
КонецПроцедуры

// Выгрузить оплаты.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
//  ВариантОбменаССайтом - ПеречислениеСсылка.ВариантыОбменаССайтом
Процедура ВыгрузитьОплаты(НачалоПериода, КонецПериода, ВариантОбменаССайтом) Экспорт
	ИмяСобытия = "Отправка оплат на сайт";
	
	Если Не ЗначениеЗаполнено(ВариантОбменаССайтом) Тогда
		ТекстСообщения = "Не указан вариант обмена с сайтом";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);		
	КонецЕсли;
	
	МассивОплат = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = "ВЫБРАТЬ
	|	ОплатаФактур.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОплатыФактур
	|ИЗ
	|	Документ.ОплатаФактур КАК ОплатаФактур
	|ГДЕ
	|	ОплатаФактур.Проведен
	|	И ОплатаФактур.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВзаиморасчетыКлиентыОбороты.Контрагент) КАК ИДКонтрагента,
	|	ВзаиморасчетыКлиентыОбороты.Валюта КАК Валюта,
	|	ВзаиморасчетыКлиентыОбороты.СуммаПриход КАК СуммаОплаты,
	|	ВзаиморасчетыКлиентыОбороты.Контрагент.Логин КАК КонтрагентЛогин,
	|	ВзаиморасчетыКлиентыОбороты.Период КАК Дата,
	|	ВзаиморасчетыКлиентыОбороты.Контрагент КАК Контрагент
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКлиенты.Обороты(,, Регистратор,) КАК ВзаиморасчетыКлиентыОбороты
	|ГДЕ
	|	ВзаиморасчетыКлиентыОбороты.Регистратор В
	|		(ВЫБРАТЬ
	|			ВТ_ОплатыФактур.Ссылка КАК Ссылка
	|		ИЗ
	|			ВТ_ОплатыФактур КАК ВТ_ОплатыФактур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИДКонтрагента,
	|	Дата";
	
	МассивКритическихОшибок = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОплаты = ШаблонОплаты();
		СтруктураОплаты.UserID = XMLСтрока(Выборка.ИДКонтрагента);
		СтруктураОплаты.Date = Выборка.Дата;
		СтруктураОплаты.Currency = СокрЛП(Выборка.Валюта);
		СтруктураОплаты.Sum = Выборка.СуммаОплаты;
		СтруктураОплаты.UserName = Выборка.КонтрагентЛогин;
		
		МассивОплат.Добавить(СтруктураОплаты);
		
		СтруктураИнформацииКонтрагент = Справочники.Контрагенты.ПолучитьРеквизитыКлиента(Выборка.Контрагент, ТекущаяДатаСеанса());
		Если ПустаяСтрока(СтруктураИнформацииКонтрагент.Email) Или ПустаяСтрока(СтруктураИнформацииКонтрагент.Телефон) Тогда
			МассивКритическихОшибок.Добавить(СтрШаблон("Не заполнен телефон или e-mail для контрагента: %1", Выборка.Контрагент));
		КонецЕсли;
	КонецЦикла;
	Если МассивКритическихОшибок.Количество() Тогда
		ТекстСообщения = СтрСоединить(МассивКритическихОшибок, Символы.ПС);
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);		
	КонецЕсли;		
	
	Если МассивОплат.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивОплат);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.ПапкаНаДиске Тогда
			Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
				ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
			КонецЕсли;
			ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "user_payments", "json");		
			ТекстовыйДокумент = Новый ТекстовыйДокумент();
			ТекстовыйДокумент.УстановитьТекст(JSON);
			ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
		ИначеЕсли ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.API Тогда
			СтруктураAPI = Новый Структура();
			СтруктураAPI.Вставить("АдресAPI", Настройки.APIСайтДляВыгрузкиДанных);
			СтруктураAPI.Вставить("РесурсAPI", Настройки.APIРесурсВыгрузкиОплат);
			СтруктураОтветаСайта = ПередатьДанныеНаСайт(JSON, СтруктураAPI);
			Если Не СтруктураОтветаСайта.Результат Тогда
				ТекстСообщения = СтрСоединить(СтруктураОтветаСайта.МассивОшибок);
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				ВызватьИсключение(ТекстСообщения);	
			КонецЕсли;
		Иначе
			ТекстСообщения = СтрШаблон("Незвестный вариант обмена с сайтом: %1", ВариантОбменаССайтом);
			ВызватьИсключение(ТекстСообщения);				
		КонецЕсли;			
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют оплаты для передачи на сайт");
	КонецЕсли;
КонецПроцедуры

// Выгрузить балансы на сервере.
// 
// Параметры:
//  ВариантОбменаССайтом - ПеречислениеСсылка.ВариантыОбменаССайтом
//  ДатаЗапроса Дата запроса - Дата
Процедура ВыгрузитьБалансыНаСервере(ВариантОбменаССайтом, ДатаЗапроса) Экспорт
	ИмяСобытия = "Отправка балансов на сайт";
	
	Если Не ЗначениеЗаполнено(ВариантОбменаССайтом) Тогда
		ТекстСообщения = "Не указан вариант обмена с сайтом";
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
		ВызватьИсключение(ТекстСообщения);		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаЗапроса", Новый Граница(ДатаЗапроса, ВидГраницы.Включая));
	Запрос.Текст = "ВЫБРАТЬ
	|	ВзаиморасчетыКлиентыОстатки.Контрагент КАК Контрагент,
	|	ВзаиморасчетыКлиентыОстатки.Валюта.Наименование КАК Валюта,
	|	ВзаиморасчетыКлиентыОстатки.СуммаОстаток КАК Сумма,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВзаиморасчетыКлиентыОстатки.Контрагент)) КАК КонтрагентИД,
	|	ВзаиморасчетыКлиентыОстатки.Валюта КАК ВалютаКоличество
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКлиенты.Остатки(&ДатаЗапроса, Контрагент.Активный) КАК ВзаиморасчетыКлиентыОстатки
	|ИТОГИ
	|	МАКСИМУМ(Валюта) КАК Валюта,
	|	МАКСИМУМ(КонтрагентИД),
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВалютаКоличество) КАК ВалютаКоличество,
	|	СУММА(Сумма)
	|ПО
	|	Контрагент";
	
	МассивДанных = Новый Массив;
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока ВыборкаКонтрагент.Следующий() Цикл
		Если ВыборкаКонтрагент.ВалютаКоличество > 1 Тогда
			Сообщение = СтрШаблон("Для пользователя: %1 есть баланс больше чем по одной валюте. Не включен в выгрузку", ВыборкаКонтрагент.Контрагент);
			
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , Сообщение);
			
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
			Продолжить;
		КонецЕсли;
		
		СтруктураБалансаКонтрагента = Новый Структура();
		СтруктураБалансаКонтрагента.Вставить("BalanceDate", КонецДня(ДатаЗапроса));
		СтруктураБалансаКонтрагента.Вставить("UserId", ВыборкаКонтрагент.КонтрагентИД);
		СтруктураБалансаКонтрагента.Вставить("Currency", ВыборкаКонтрагент.Валюта);
		СтруктураБалансаКонтрагента.Вставить("Balance", ВыборкаКонтрагент.Сумма);
		
		МассивДанных.Добавить(СтруктураБалансаКонтрагента);		
	КонецЦикла;
		
	Если МассивДанных.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивДанных);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.ПапкаНаДиске Тогда
			Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
				ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
			КонецЕсли;
			ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "user_balance", "json");		
			ТекстовыйДокумент = Новый ТекстовыйДокумент();
			ТекстовыйДокумент.УстановитьТекст(JSON);
			ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
		ИначеЕсли ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.API Тогда
			СтруктураAPI = Новый Структура();
			СтруктураAPI.Вставить("АдресAPI", Настройки.APIСайтДляВыгрузкиДанных);
			СтруктураAPI.Вставить("РесурсAPI", Настройки.APIРесурсВыгрузкиБаланса);
			СтруктураОтветаСайта = ПередатьДанныеНаСайт(JSON, СтруктураAPI);
			Если Не СтруктураОтветаСайта.Результат Тогда
				ТекстСообщения = СтрСоединить(СтруктураОтветаСайта.МассивОшибок);
				ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстСообщения);
				ВызватьИсключение(ТекстСообщения);	
			КонецЕсли;
		Иначе
			ТекстСообщения = СтрШаблон("Незвестный вариант обмена с сайтом: %1", ВариантОбменаССайтом);
			ВызватьИсключение(ТекстСообщения);				
		КонецЕсли;			
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют балансы для передачи на сайт");
	КонецЕсли;	
КонецПроцедуры	

// Массив транзакций фактуре.
// 
// Параметры:
//  МассивФактур - Массив Из ДокументСсылка.Фактура
// 
// Возвращаемое значение:
//  Строка
//@skip-check redundant-export-method
//@skip-check module-structure-method-in-regions
Функция МассивТранзакцийФактуре(МассивФактур) Экспорт
	МассивСтруктур = Новый Массив; //Массив из см. ШаблонСтруктурыСтрокиТранзакции()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивФактур", МассивФактур);
	Запрос.Текст = "ВЫБРАТЬ
	|	ФактураТранзакции.ДатаТранзакции КАК Transaction_datetime,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Карта) КАК Card,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФактураТранзакции.Клиент)) КАК Partner,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Автомобиль) КАК Car,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.МестоТранзакции) КАК GasStation,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Продукт) КАК Product,
	|	ФактураТранзакции.Количество КАК Quantity,
	|	ФактураТранзакции.Цена КАК Price,
	|	ФактураТранзакции.Цена * ФактураТранзакции.Количество КАК Amount,
	|	ФактураТранзакции.Итого КАК Total,
	|	ФактураТранзакции.СуммаСкидки КАК DiscountAmount,
	|	ФактураТранзакции.Скидка КАК Discount,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.ВалютаПоставщика) КАК Currency,
	|	ФактураТранзакции.ЦенаСоСкидкой КАК PriceWithDiscount
	|ИЗ
	|	Документ.Фактура.Транзакции КАК ФактураТранзакции
	|ГДЕ
	|	ФактураТранзакции.Ссылка В (&МассивФактур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФактураТранзакции.Клиент,
	|	Transaction_datetime";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = ШаблонСтруктурыСтрокиТранзакции();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);
		
		МассивСтруктур.Добавить(СтруктураСтроки);
	КонецЦикла;	
	
	МассивТранзакцияJSON = Exprovip.СериализоватьJSON(МассивСтруктур);
	
	Возврат МассивТранзакцияJSON;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Таблица печати шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица печати шаблон:
// * Выбран - Булево - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * НомерФактуры - Число - 
// * ЭтапОплаты - Число - 
Функция ТаблицаПечатиШаблон()
	ТаблицаПечати = Новый ТаблицаЗначений();
	ТаблицаПечати.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	ТаблицаПечати.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаПечати.Колонки.Добавить("НомерФактуры", Новый ОписаниеТипов("Число"));
	ТаблицаПечати.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаПечати;
КонецФункции

// Таблица данные шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица данные шаблон:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
Функция ТаблицаДанныеШаблон()
	ТаблицаДанные = Новый ТаблицаЗначений();
	ТаблицаДанные.Колонки.Добавить("ДатаТранзакции", Новый ОписаниеТипов("Дата"));
	ТаблицаДанные.Колонки.Добавить("Карта", Новый ОписаниеТипов("СправочникСсылка.Карточки"));
	ТаблицаДанные.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанные.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДанные.Колонки.Добавить("МестоТранзакции", Новый ОписаниеТипов("СправочникСсылка.МестаТранзакции"));
	ТаблицаДанные.Колонки.Добавить("Продукт", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Итого", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДанные.Колонки.Добавить("Скидка", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЦенаСоСкидкой", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаДанные;
КонецФункции

// Получить табличный документ.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты - Контрагент ссылка
//  ЭтапОплаты - Число - Этап оплаты
//  НомерФактуры - Число - Номер фактуры
//  ТаблицаДанные - ТаблицаЗначений - Таблица данные:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
//  ФактураСсылка - ДокументСсылка.Фактура
// 
// Возвращаемое значение:
//  Структура - Получить табличный документ:
// * ТабличныйДокумент - ТабличныйДокумент - 
// * ИмяФайла - Строка - 
// * НомерФактуры - Строка - 
// * ДатаФактуры - Дата - 
Функция ПолучитьТабличныйДокумент(КонтрагентСсылка, ЭтапОплаты, НомерФактуры, ТаблицаДанные, ФактураСсылка)
	ТаблицаДанныеВременная = ТаблицаДанные;
	
	Возврат Документы.Фактура.СтруктураФактурыКлиента(
		КонтрагентСсылка,
		ЭтапОплаты,
		НомерФактуры,
		ФактураСсылка,
		ТаблицаДанныеВременная);
КонецФункции

// Шаблон структуры фактуры для печати.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры фактуры для печати:
// * Date - Строка - 
// * UserID - Строка -
// * Number - Строка - 
// * Currency - Строка - 
// * Amount - Строка - 
// * Metadata - Строка - 
Функция ШаблонСтруктурыФактурыДляПечати()
	Структура = Новый Структура();
	Структура.Вставить("UserID", "");
	Структура.Вставить("Date", "");
	Структура.Вставить("Number", "");
	Структура.Вставить("Currency", "");
	Структура.Вставить("Amount", "");
	Структура.Вставить("Metadata", "");
	
	Возврат Структура;
КонецФункции

// Шаблон структуры клиента.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры клиента:
// * Name - Строка -
// * UserID - Строка - 
// * Phone - Строка - 
// * Email - Строка - 
// * Discount - Строка - 
// * Cards - Массив из См. ШаблонСтруктурыКарты() 
Функция ШаблонСтруктурыКлиента()
	Структура = Новый Структура();
	Структура.Вставить("UserID", "");
	Структура.Вставить("Name", "");
	Структура.Вставить("Phone", "");
	Структура.Вставить("Email", "");
	Структура.Вставить("Discount", "");
	Структура.Вставить("Cards", Новый Массив); //См. ШаблонСтруктурыКарты()
	
	Возврат Структура;
КонецФункции

// Шаблон структуры карты.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры карты:
// * CardNumber - Строка
// * IsBlocked - Строка
// * TotalLimit - Строка -
// * Limits - Массив из См. ШаблонСтруктураЛимита() 
Функция ШаблонСтруктурыКарты()
	Структура = Новый Структура();
	Структура.Вставить("CardNumber", "");
	Структура.Вставить("IsBlocked", "");
	Структура.Вставить("TotalLimit", "");
	Структура.Вставить("Limits", Новый Массив); //См. ШаблонСтруктураЛимита();
	
	Возврат Структура;	
КонецФункции

// Шаблон структура лимита.
// 
// Возвращаемое значение:
//  Структура - Шаблон структура лимита:
// * Product - Строка - 
// * LimitPerDay - Число - 
// * LimitPerMonth - Число - 
Функция ШаблонСтруктураЛимита()
	Структура = Новый Структура();
	Структура.Вставить("Product", "");
	Структура.Вставить("LimitPerDay", 0);
	Структура.Вставить("LimitPerMonth", 0);
	
	Возврат Структура;
КонецФункции		

// Шаблон оплаты.
// 
// Возвращаемое значение:
//  Структура - Шаблон оплаты:
// * UserID - Строка - 
// * UserName - Строка - 
// * Date - Строка - 
// * Currency - Строка - 
// * Sum - Строка - 
Функция ШаблонОплаты()
	Структура = Новый Структура();
	Структура.Вставить("UserID", "");
	Структура.Вставить("UserName", "");
	Структура.Вставить("Date", "");
	Структура.Вставить("Currency", "");
	Структура.Вставить("Sum", "");
	
	Возврат Структура;
КонецФункции

// Шаблон структуры строки.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры строки:
// * Transaction_datetime - Дата - 
// * Card - Строка - 
// * Partner - Строка - 
// * Car - Строка - 
// * GasStation - Строка - 
// * Product - Строка - 
// * Quantity - Число - 
// * Price - Число - 
// * Amount - Число - 
// * Total - Число - 
// * DiscountAmount - Число - 
// * Discount - Число - 
// * PriceWithDiscount - Число - 
// * Currency - Строка - 
Функция ШаблонСтруктурыСтрокиТранзакции()
	Структура = Новый Структура;
	Структура.Вставить("Transaction_datetime", Дата(1, 1, 1));
	Структура.Вставить("Card", "");
	Структура.Вставить("Partner", "");
	Структура.Вставить("Car", "");
	Структура.Вставить("GasStation", "");
	Структура.Вставить("Product", "");
	Структура.Вставить("Quantity", 0);
	Структура.Вставить("Price", 0);
	Структура.Вставить("Amount", 0);
	//Структура.Вставить("Total", 0);
	//Структура.Вставить("DiscountAmount", 0);
	Структура.Вставить("Discount", 0);
	//Структура.Вставить("PriceWithDiscount", 0);	
	Структура.Вставить("Currency", "");
	
	Возврат Структура;
КонецФункции

// Передать данные на сайт.
// 
// Параметры:
//  ДанныеJSON - Строка - Данные JSON
//  СтруктураAPI - Структура - Структура API:
// * АдресAPI - Строка - 
// * РесурсAPI - Строка - 
// 
// Возвращаемое значение:
//  Структура - Передать данные на сайт:
// * Результат - Булево - 
// * МассивОшибок - Массив из Строка 
// * Комментарий - Строка - 
Функция ПередатьДанныеНаСайт(ДанныеJSON, СтруктураAPI)
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Результат", Истина);
	СтруктураОтвета.Вставить("МассивОшибок", Новый Массив);
	СтруктураОтвета.Вставить("Комментарий", "");
	
	АдресАпи = СтруктураAPI.АдресAPI;
	АдресРесурса = СтруктураAPI.РесурсAPI;
	
	Настройки = Справочники.Настройки.ПолучитьНастройки();
	
	ТелоЗапроса = ДанныеJSON;
	
	Попытка	
		Соединение = Новый HTTPСоединение(АдресАпи, , , , , , Истина);
		Запрос = Новый HTTPЗапрос(АдресРесурса);
		Запрос.Заголовки.Вставить("X-Webhook-Key", СокрЛП(Настройки.APIKey));
		Запрос.Заголовки.Вставить("Content-Type", "application/json");
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Если Ответ.КодСостояния <> 200 Тогда
			СтруктураОтвета.Результат = Ложь;
			Попытка
				ОтветСоответствие = Exprovip.ДесериалозоватьJSON(ТелоОтвета, Истина); //Соответствие
				ИтоговыйРезультат = ОтветСоответствие.Получить("message");
				СтруктураОтвета.МассивОшибок.Добавить(ИтоговыйРезультат);
				СоответствиеОшибок = ОтветСоответствие.Получить("errors"); //Соответствие
				Для Каждого КлючИЗначение Из СоответствиеОшибок Цикл
					ТекущееСообщение = Новый Массив;
					ТекущееСообщение.Добавить(КлючИЗначение.Ключ);
					Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
						Для Каждого СообщениеВМассиве Из КлючИЗначение.Значение Цикл
							ТекущееСообщение.Добавить(СообщениеВМассиве);
						КонецЦикла;	
					КонецЕсли;
					СтруктураОтвета.МассивОшибок.Добавить(СтрСоединить(ТекущееСообщение, Символы.ПС));
				КонецЦикла;	
			Исключение	
				СтруктураОтвета.МассивОшибок.Добавить(СтрШаблон("Код ответа: %1. Ответ: %2", Ответ.КодСостояния, ТелоОтвета));
			КонецПопытки;
		Иначе
			ОтветСтруктура = Exprovip.ДесериалозоватьJSON(ТелоОтвета, Истина); //Соответствие
			СтруктураОтвета.Результат = ОтветСтруктура.Получить("success");
			СтруктураОтвета.Комментарий = ОтветСтруктура.Получить("message");
			
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Ответ сайта: %1", СтруктураОтвета.Комментарий));	
		КонецЕсли;
	Исключение
		Ошибка = ОписаниеОшибки();
		СтруктураОтвета.Результат = Ложь;
		СтруктураОтвета.МассивОшибок.Добавить(Ошибка);
	КонецПопытки;
	
	Возврат СтруктураОтвета;	
КонецФункции		

#КонецОбласти

#КонецЕсли