
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выгрузить транзакции.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьТранзакции(НачалоПериода, КонецПериода) Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	МассивФактур = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Фактура");
				
	JSON = МассивТранзакцийФактуре(МассивФактур);
	
	Настройки = Справочники.Настройки.ПолучитьНастройки();
	
	Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
		ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
	КонецЕсли;
	ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "transactions", "json");		
	ТекстовыйДокумент = Новый ТекстовыйДокумент();
	ТекстовыйДокумент.УстановитьТекст(JSON);
	ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);
	
КонецПроцедуры

// Выгрузить фактуры.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьФактуры(НачалоПериода, КонецПериода) Экспорт
	МассивСтруктур = Новый Массив(); //Массив из См. ШаблонСтруктурыФактурыДляПечати()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Фактура.Ссылка КАК Фактура
	|ИЗ
	|	Документ.Фактура КАК Фактура
	|ГДЕ
	|	Фактура.Проведен
	|	И Фактура.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТаблицаПечати = ТаблицаПечатиШаблон();
		ТаблицаДанные = ТаблицаДанныеШаблон();

		ФактураОбъект = Выборка.Фактура.ПолучитьОбъект();
		СтруктураПечати = Документы.Фактура.ПолучитьСтруктуруПечати(ФактураОбъект);

		Документы.Фактура.ЗаполнитьТаблицуПечати(СтруктураПечати, ТаблицаПечати);
		Документы.Фактура.ЗаполнитьТаблицаДанные(СтруктураПечати, ТаблицаДанные);
		
		Счетчик = 0;
		
		Для Каждого СтрокаТЧ Из ТаблицаПечати Цикл
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("pdf");
			
			Счетчик = Счетчик + 1;
			Если Счетчик >= 2 Тогда
				Прервать;
			КонецЕсли;	
			
			//@skip-check query-in-loop
			Структура = ПолучитьТабличныйДокумент(
				СтрокаТЧ.Контрагент,
				СтрокаТЧ.ЭтапОплаты,
				СтрокаТЧ.НомерФактуры,
				ТаблицаДанные,
				Выборка.Фактура);
			ТабличныйДокумент = Структура.ТабличныйДокумент;
			ТабличныйДокумент.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.PDF);
			
			ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременногоФайла);
						
			СтруктураТекущейФактуры = ШаблонСтруктурыФактурыДляПечати();
			СтруктураТекущейФактуры.UserID = XMLСтрока(СтрокаТЧ.Контрагент);
			СтруктураТекущейФактуры.Number = Структура.НомерФактуры;
			СтруктураТекущейФактуры.Date = Структура.ДатаФактуры;
			СтруктураТекущейФактуры.Currency = СокрЛП(Структура.ВалютаФактуры);
			СтруктураТекущейФактуры.Amount = Структура.СуммаФактуры;
			СтруктураТекущейФактуры.Metadata = Base64Строка(ДвоичныеДанные);
			
			МассивСтруктур.Добавить(СтруктураТекущейФактуры);
			
			Попытка
				УдалитьФайлы(ИмяВременногоФайла);	
			Исключение
				ЗаписьЖурналаРегистрации("ОбменССайтом", УровеньЖурналаРегистрации.Ошибка, , , ОписаниеОшибки());
			КонецПопытки;			
		КонецЦикла;		
	КонецЦикла;	
	
	Если МассивСтруктур.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивСтруктур);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
			ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
		КонецЕсли;
		ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "invoices", "json");		
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.УстановитьТекст(JSON);
		ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутсвуют фактуры для передачи на сайт");
	КонецЕсли;	
КонецПроцедуры

// Выгрузить клиентов.
Процедура ВыгрузитьКлиентов() Экспорт
	МассивКлиентов = Новый Массив; //См. ШаблонСтруктурыКлиента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Код КАК Код,
	|	Карточки.Наименование КАК НомерКарты,
	|	Карточки.Владелец КАК Контрагент,
	|	Карточки.Блокировка КАК Блокировка,
	|	Карточки.Архивная КАК Архивная,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Карточки.Владелец) КАК ИДКонтрагента,
	|	ЕСТЬNULL(КонтрагентыЛимитыПоКартам.Продукт.Наименование, """""""") КАК Продукт,
	|	ЕСТЬNULL(КонтрагентыЛимитыПоКартам.ЛимитВМесяц, 0) КАК ЛимитВМесяц,
	|	ЕСТЬNULL(КонтрагентыЛимитыПоКартам.ЛимитВДень, 0) КАК ЛимитВДень,
	|	Карточки.Эмитент КАК Эмитент
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.ЛимитыПоКартам КАК КонтрагентыЛимитыПоКартам
	|		ПО Карточки.Владелец = КонтрагентыЛимитыПоКартам.Ссылка
	|		И Карточки.Эмитент = КонтрагентыЛимитыПоКартам.Эмитент
	|ГДЕ
	|	НЕ Карточки.ПометкаУдаления
	|	И Карточки.Владелец.Активный
	|ИТОГИ
	|	МАКСИМУМ(Код),
	|	МАКСИМУМ(Блокировка),
	|	МАКСИМУМ(Архивная),
	|	МАКСИМУМ(ИДКонтрагента),
	|	СУММА(ЛимитВМесяц),
	|	СУММА(ЛимитВДень),
	|	МАКСИМУМ(Эмитент)
	|ПО
	|	Контрагент,
	|	НомерКарты";
	
	ВыборкаКонтрагент = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
	Пока ВыборкаКонтрагент.Следующий() Цикл
		СтруктураИнформацииКонтрагент = Справочники.Контрагенты.ПолучитьРеквизитыКлиента(ВыборкаКонтрагент.Контрагент, ТекущаяДатаСеанса());
	
		СтруктураТекущегоКонтрагента = ШаблонСтруктурыКлиента();
		СтруктураТекущегоКонтрагента.Name = СтруктураИнформацииКонтрагент.НазваниеКлиента;
		СтруктураТекущегоКонтрагента.UserID = XMLСтрока(ВыборкаКонтрагент.ИДКонтрагента);
		СтруктураТекущегоКонтрагента.Phone = СтруктураИнформацииКонтрагент.Телефон;
		СтруктураТекущегоКонтрагента.Discount = СокрЛП(СтруктураИнформацииКонтрагент.Тариф);
		СтруктураТекущегоКонтрагента.Email = СтруктураИнформацииКонтрагент.Email;
		ВыборкаКарты = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НомерКарты");
		Пока ВыборкаКарты.Следующий() Цикл
		
			СтруктураТекущейКарты = ШаблонСтруктурыКарты();
			СтруктураТекущейКарты.CardNumber = ВыборкаКарты.НомерКарты;
			СтруктураТекущейКарты.IsBlocked = ВыборкаКарты.Блокировка;
			СтруктураТекущейКарты.TotalLimit = "неограничено";
			
			Если ВыборкаКарты.ЛимитВМесяц <> 0 ИЛИ ВыборкаКарты.ЛимитВДень <> 0 Тогда
				ВыборкаЛимиты = ВыборкаКарты.Выбрать();
				Пока ВыборкаЛимиты.Следующий() Цикл				
					СтруктураЛимита = ШаблонСтруктураЛимита();
					СтруктураЛимита.Product = ВыборкаЛимиты.Продукт;
					СтруктураЛимита.LimitPerDay = ВыборкаЛимиты.ЛимитВДень;
					СтруктураЛимита.LimitPerMonth = ВыборкаЛимиты.ЛимитВМесяц;
					СтруктураТекущейКарты.Limits.Добавить(СтруктураЛимита);
				КонецЦикла;
			КонецЕсли;		
			
			СтруктураТекущегоКонтрагента.Cards.Добавить(СтруктураТекущейКарты);
		КонецЦикла;	
		
		МассивКлиентов.Добавить(СтруктураТекущегоКонтрагента);
	КонецЦикла;	
	
	Если МассивКлиентов.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивКлиентов);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
			ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
		КонецЕсли;
		ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "users", "json");		
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.УстановитьТекст(JSON);
		ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют пользователи для передачи на сайт");
	КонецЕсли;	
КонецПроцедуры

// Выгрузить оплаты.
// 
// Параметры:
//  НачалоПериода - Дата
//  КонецПериода - Дата
Процедура ВыгрузитьОплаты(НачалоПериода, КонецПериода) Экспорт
	МассивОплат = Новый Массив;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	Запрос.Текст = "ВЫБРАТЬ
	|	ОплатаФактур.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ОплатыФактур
	|ИЗ
	|	Документ.ОплатаФактур КАК ОплатаФактур
	|ГДЕ
	|	ОплатаФактур.Проведен
	|	И ОплатаФактур.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ВзаиморасчетыКлиентыОбороты.Контрагент) КАК ИДКонтрагента,
	|	ВзаиморасчетыКлиентыОбороты.Валюта КАК Валюта,
	|	ВзаиморасчетыКлиентыОбороты.СуммаПриход КАК СуммаОплаты,
	|	ВзаиморасчетыКлиентыОбороты.Контрагент.Логин КАК КонтрагентЛогин,
	|	ВзаиморасчетыКлиентыОбороты.Период КАК Дата
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыКлиенты.Обороты(,, Регистратор,) КАК ВзаиморасчетыКлиентыОбороты
	|ГДЕ
	|	ВзаиморасчетыКлиентыОбороты.Регистратор В
	|		(ВЫБРАТЬ
	|			ВТ_ОплатыФактур.Ссылка КАК Ссылка
	|		ИЗ
	|			ВТ_ОплатыФактур КАК ВТ_ОплатыФактур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИДКонтрагента,
	|	Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураОплаты = ШаблонОплаты();
		СтруктураОплаты.UserID = XMLСтрока(Выборка.ИДКонтрагента);
		СтруктураОплаты.Date = Выборка.Дата;
		СтруктураОплаты.Currency = СокрЛП(Выборка.Валюта);
		СтруктураОплаты.Sum = Выборка.СуммаОплаты;
		СтруктураОплаты.UserName = Выборка.КонтрагентЛогин;
		
		МассивОплат.Добавить(СтруктураОплаты);
	КонецЦикла;	
	
	Если МассивОплат.Количество() > 0 Тогда
		JSON = Exprovip.СериализоватьJSON(МассивОплат);
	
		Настройки = Справочники.Настройки.ПолучитьНастройки();
		
		Если ПустаяСтрока(Настройки.ПутьВыгрузкиДляСайта) Тогда
			ВызватьИсключение(СтрШаблон("Не задан значения для: %1", "Путь выгрузки для сайта"));
		КонецЕсли;
		ИмяФайлаВыгрузки = Exprovip.СформироватьИмяФайлаПоПути(Настройки.ПутьВыгрузкиДляСайта, "user_payments", "json");		
		ТекстовыйДокумент = Новый ТекстовыйДокумент();
		ТекстовыйДокумент.УстановитьТекст(JSON);
		ТекстовыйДокумент.Записать(ИмяФайлаВыгрузки);	
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Отсутствуют оплаты для передачи на сайт");
	КонецЕсли;
КонецПроцедуры	

// Массив транзакций фактуре.
// 
// Параметры:
//  МассивФактур - Массив Из ДокументСсылка.Фактура
// 
// Возвращаемое значение:
//  Строка
//@skip-check redundant-export-method
//@skip-check module-structure-method-in-regions
Функция МассивТранзакцийФактуре(МассивФактур) Экспорт
	МассивСтруктур = Новый Массив; //Массив из см. ШаблонСтруктурыСтрокиТранзакции()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивФактур", МассивФактур);
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 10
	|	ФактураТранзакции.ДатаТранзакции КАК Transaction_datetime,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Карта) КАК Card,
	|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(ФактураТранзакции.Клиент)) КАК Partner,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Автомобиль) КАК Car,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.МестоТранзакции) КАК GasStation,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.Продукт) КАК Product,
	|	ФактураТранзакции.Количество КАК Quantity,
	|	ФактураТранзакции.Цена КАК Price,
	|	ФактураТранзакции.Цена * ФактураТранзакции.Количество КАК Amount,
	|	ФактураТранзакции.Итого КАК Total,
	|	ФактураТранзакции.СуммаСкидки КАК DiscountAmount,
	|	ФактураТранзакции.Скидка КАК Discount,
	|	ПРЕДСТАВЛЕНИЕ(ФактураТранзакции.ВалютаПоставщика) КАК Currency,
	|	ФактураТранзакции.ЦенаСоСкидкой КАК PriceWithDiscount
	|ИЗ
	|	Документ.Фактура.Транзакции КАК ФактураТранзакции
	|ГДЕ
	|	ФактураТранзакции.Ссылка В (&МассивФактур)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ФактураТранзакции.Клиент,
	|	Transaction_datetime";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СтруктураСтроки = ШаблонСтруктурыСтрокиТранзакции();
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Выборка);
		
		МассивСтруктур.Добавить(СтруктураСтроки);
	КонецЦикла;	
	
	МассивТранзакцияJSON = Exprovip.СериализоватьJSON(МассивСтруктур);
	
	Возврат МассивТранзакцияJSON;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Таблица печати шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица печати шаблон:
// * Выбран - Булево - 
// * Контрагент - СправочникСсылка.Контрагенты - 
// * НомерФактуры - Число - 
// * ЭтапОплаты - Число - 
Функция ТаблицаПечатиШаблон()
	ТаблицаПечати = Новый ТаблицаЗначений();
	ТаблицаПечати.Колонки.Добавить("Выбран", Новый ОписаниеТипов("Булево"));
	ТаблицаПечати.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаПечати.Колонки.Добавить("НомерФактуры", Новый ОписаниеТипов("Число"));
	ТаблицаПечати.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаПечати;
КонецФункции

// Таблица данные шаблон.
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица данные шаблон:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
Функция ТаблицаДанныеШаблон()
	ТаблицаДанные = Новый ТаблицаЗначений();
	ТаблицаДанные.Колонки.Добавить("ДатаТранзакции", Новый ОписаниеТипов("Дата"));
	ТаблицаДанные.Колонки.Добавить("Карта", Новый ОписаниеТипов("СправочникСсылка.Карточки"));
	ТаблицаДанные.Колонки.Добавить("Клиент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	ТаблицаДанные.Колонки.Добавить("Автомобиль", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(100)));
	ТаблицаДанные.Колонки.Добавить("МестоТранзакции", Новый ОписаниеТипов("СправочникСсылка.МестаТранзакции"));
	ТаблицаДанные.Колонки.Добавить("Продукт", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаДанные.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Итого", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("СуммаСкидки", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЭтапОплаты", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДанные.Колонки.Добавить("Скидка", Новый ОписаниеТипов("Число"));
	ТаблицаДанные.Колонки.Добавить("ЦенаСоСкидкой", Новый ОписаниеТипов("Число"));
	
	Возврат ТаблицаДанные;
КонецФункции

// Получить табличный документ.
// 
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты - Контрагент ссылка
//  ЭтапОплаты - Число - Этап оплаты
//  НомерФактуры - Число - Номер фактуры
//  ТаблицаДанные - ТаблицаЗначений - Таблица данные:
// * ДатаТранзакции - Дата - 
// * Карта - СправочникСсылка.Карточки - 
// * Клиент - СправочникСсылка.Контрагенты - 
// * Автомобиль - Строка - 
// * МестоТранзакции - СправочникСсылка.МестаТранзакции - 
// * Продукт - СправочникСсылка.Номенклатура - 
// * Количество - Число - 
// * Цена - Число - 
// * Сумма - Число - 
// * Итого - Число - 
// * СуммаСкидки - Число - 
// * ЭтапОплаты - Число - 
// * Валюта - СправочникСсылка.Валюты - 
// * Скидка - Число - 
// * ЦенаСоСкидкой - Число - 
//  ФактураСсылка - ДокументСсылка.Фактура
// 
// Возвращаемое значение:
//  Структура - Получить табличный документ:
// * ТабличныйДокумент - ТабличныйДокумент - 
// * ИмяФайла - Строка - 
// * НомерФактуры - Строка - 
// * ДатаФактуры - Дата - 
Функция ПолучитьТабличныйДокумент(КонтрагентСсылка, ЭтапОплаты, НомерФактуры, ТаблицаДанные, ФактураСсылка)
	ТаблицаДанныеВременная = ТаблицаДанные;
	
	Возврат Документы.Фактура.СтруктураФактурыКлиента(
		КонтрагентСсылка,
		ЭтапОплаты,
		НомерФактуры,
		ФактураСсылка,
		ТаблицаДанныеВременная);
КонецФункции

// Шаблон структуры фактуры для печати.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры фактуры для печати:
// * Date - Строка - 
// * UserID - Строка -
// * Number - Строка - 
// * Currency - Строка - 
// * Amount - Строка - 
// * Metadata - Строка - 
Функция ШаблонСтруктурыФактурыДляПечати()
	Структура = Новый Структура();
	Структура.Вставить("UserID", "");
	Структура.Вставить("Date", "");
	Структура.Вставить("Number", "");
	Структура.Вставить("Currency", "");
	Структура.Вставить("Amount", "");
	Структура.Вставить("Metadata", "");
	
	Возврат Структура;
КонецФункции

// Шаблон структуры клиента.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры клиента:
// * Name - Строка -
// * UserID - Строка - 
// * Phone - Строка - 
// * Email - Строка - 
// * Discount - Строка - 
// * Cards - Массив из См. ШаблонСтруктурыКарты() 
Функция ШаблонСтруктурыКлиента()
	Структура = Новый Структура();
	Структура.Вставить("UserID", "");
	Структура.Вставить("Name", "");
	Структура.Вставить("Phone", "");
	Структура.Вставить("Email", "");
	Структура.Вставить("Discount", "");
	Структура.Вставить("Cards", Новый Массив); //См. ШаблонСтруктурыКарты()
	
	Возврат Структура;
КонецФункции

// Шаблон структуры карты.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры карты:
// * CardNumber - Строка
// * IsBlocked - Строка
// * TotalLimit - Строка -
// * Limits - Массив из См. ШаблонСтруктураЛимита() 
Функция ШаблонСтруктурыКарты()
	Структура = Новый Структура();
	Структура.Вставить("CardNumber", "");
	Структура.Вставить("IsBlocked", "");
	Структура.Вставить("TotalLimit", "");
	Структура.Вставить("Limits", Новый Массив); //См. ШаблонСтруктураЛимита();
	
	Возврат Структура;	
КонецФункции

// Шаблон структура лимита.
// 
// Возвращаемое значение:
//  Структура - Шаблон структура лимита:
// * Product - Строка - 
// * LimitPerDay - Число - 
// * LimitPerMonth - Число - 
Функция ШаблонСтруктураЛимита()
	Структура = Новый Структура();
	Структура.Вставить("Product", "");
	Структура.Вставить("LimitPerDay", 0);
	Структура.Вставить("LimitPerMonth", 0);
	
	Возврат Структура;
КонецФункции		

// Шаблон оплаты.
// 
// Возвращаемое значение:
//  Структура - Шаблон оплаты:
// * UserID - Строка - 
// * UserName - Строка - 
// * Date - Строка - 
// * Currency - Строка - 
// * Sum - Строка - 
Функция ШаблонОплаты()
	Структура = Новый Структура();
	Структура.Вставить("UserID", "");
	Структура.Вставить("UserName", "");
	Структура.Вставить("Date", "");
	Структура.Вставить("Currency", "");
	Структура.Вставить("Sum", "");
	
	Возврат Структура;
КонецФункции

// Шаблон структуры строки.
// 
// Возвращаемое значение:
//  Структура - Шаблон структуры строки:
// * Transaction_datetime - Дата - 
// * Card - Строка - 
// * Partner - Строка - 
// * Car - Строка - 
// * GasStation - Строка - 
// * Product - Строка - 
// * Quantity - Число - 
// * Price - Число - 
// * Amount - Число - 
// * Total - Число - 
// * DiscountAmount - Число - 
// * Discount - Число - 
// * PriceWithDiscount - Число - 
// * Currency - Строка - 
Функция ШаблонСтруктурыСтрокиТранзакции()
	Структура = Новый Структура;
	Структура.Вставить("Transaction_datetime", Дата(1, 1, 1));
	Структура.Вставить("Card", "");
	Структура.Вставить("Partner", "");
	Структура.Вставить("Car", "");
	Структура.Вставить("GasStation", "");
	Структура.Вставить("Product", "");
	Структура.Вставить("Quantity", 0);
	Структура.Вставить("Price", 0);
	Структура.Вставить("Amount", 0);
	//Структура.Вставить("Total", 0);
	//Структура.Вставить("DiscountAmount", 0);
	Структура.Вставить("Discount", 0);
	//Структура.Вставить("PriceWithDiscount", 0);	
	Структура.Вставить("Currency", "");
	
	Возврат Структура;
КонецФункции		

#КонецОбласти

#КонецЕсли