
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВзаиморасчетыСКлиентами();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура ВзаиморасчетыСКлиентами()
	Если Дата < Константы.ДатаНачалаДвиженияПоРегистрамВзаиморасчетов.Получить() Тогда
		Возврат;
	КонецЕсли;	
	Движения.ВзаиморасчетыКлиенты.Записывать = Истина;
	Для Каждого ТекСтрокаОплаты Из Оплаты Цикл
		Движение = Движения.ВзаиморасчетыКлиенты.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = ТекСтрокаОплаты.Контрагент;
		Движение.Валюта = ТекСтрокаОплаты.Валюта;
		Движение.Сумма = ТекСтрокаОплаты.Сумма;
		Движение.ДатаТранзакции = Дата;
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

