#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьДоступность();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантОбменаССайтомПриИзменении(Элемент)
	УстановитьДоступность();	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыгрузитьТранзакции(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	
	ВыгрузитьТранзакцииНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка транзакций завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФактуры(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьФактурыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка фактур завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКлиентов(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьКлиентовНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка пользователей завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОплаты(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ВыгрузитьОплатыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка оплат завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьБалансы(Команда)
	Если Не ЗначениеЗаполнено(Объект.ДатаБалансов) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не заполнена дата баланса", , , "Объект.ДатаБалансов");
		Возврат;
	КонецЕсли;	
	ВыгрузитьБалансыНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка балансов завершена");	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОплаты(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьОплатыНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Оплаты успешно удалены");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТранзакции(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьТранзакцииНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Транзакции успешно удалены");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьБалансы(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьБалансыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Балансы успешно удалены");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФактуры(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	УдалитьФактурыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Фактуры успешно удалены");
КонецПроцедуры

&НаКлиенте
Процедура УдалитьКарты(Команда)
	УдалитьКартыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Карты успешно удалены");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьТранзакцииНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьТранзакции(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания, Объект.ВариантОбменаССайтом);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФактурыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьФактуры(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания, Объект.ВариантОбменаССайтом);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьКлиентовНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьКлиентов(Объект.ВариантОбменаССайтом);	
КонецПроцедуры	

&НаСервере
Процедура ВыгрузитьОплатыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьОплаты(
		ПериодВыборкиТранзакций.ДатаНачала,
	 	ПериодВыборкиТранзакций.ДатаОкончания,
	 	Объект.ВариантОбменаССайтом);
КонецПроцедуры

&НаСервере
Процедура УдалитьОплатыНаСервере()
	Обработки.ОбменССайтом.УдалитьДанные("payments",
		ПериодВыборкиТранзакций.ДатаНачала,
	 	ПериодВыборкиТранзакций.ДатаОкончания);	
КонецПроцедуры	

&НаСервере
Процедура УдалитьТранзакцииНаСервере()
	Обработки.ОбменССайтом.УдалитьДанные("transactions",
		ПериодВыборкиТранзакций.ДатаНачала,
	 	ПериодВыборкиТранзакций.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура УдалитьБалансыНаСервере()
	Обработки.ОбменССайтом.УдалитьДанные("user_balances",
		ПериодВыборкиТранзакций.ДатаНачала,
	 	ПериодВыборкиТранзакций.ДатаОкончания);	
КонецПроцедуры

&НаСервере
Процедура УдалитьФактурыНаСервере()
	Обработки.ОбменССайтом.УдалитьДанные("invoices",
		ПериодВыборкиТранзакций.ДатаНачала,
	 	ПериодВыборкиТранзакций.ДатаОкончания);	
КонецПроцедуры	

&НаСервере
Процедура ВыгрузитьБалансыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьБалансыНаСервере(Объект.ВариантОбменаССайтом, Объект.ДатаБалансов);	
КонецПроцедуры

&НаСервере
Процедура УдалитьКартыНаСервере()
	Обработки.ОбменССайтом.УдалитьКартыКлиентов();
КонецПроцедуры	

&НаСервере
Процедура УстановитьДоступность()
	ДоступностьЭлемента = Истина;
	Если Объект.ВариантОбменаССайтом = Перечисления.ВариантыОбменаССайтом.API Тогда
		ДоступностьЭлемента = Ложь;
	КонецЕсли;
		
	Элементы.ГруппаУдаление.Доступность = Не ДоступностьЭлемента;
КонецПроцедуры	

#КонецОбласти
