#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыгрузитьТранзакции(Команда)
	ВыгрузитьТранзакцииНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка транзакций завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФактуры(Команда)
	ВыгрузитьФактурыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка фактур завершена");
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьТранзакцииНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьТранзакции(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФактурыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьФактуры(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания);
КонецПроцедуры	

#КонецОбласти
