#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыгрузитьТранзакции(Команда)
	ВыгрузитьТранзакцииНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка транзакций завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФактуры(Команда)
	ВыгрузитьФактурыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка фактур завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьКлиентов(Команда)
	ВыгрузитьКлиентовНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка пользователей завершена");
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьОплаты(Команда)
	ВыгрузитьОплатыНаСервере();
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Выгрузка оплат завершена");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыгрузитьТранзакцииНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьТранзакции(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьФактурыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьФактуры(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьКлиентовНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьКлиентов();	
КонецПроцедуры	

&НаСервере
Процедура ВыгрузитьОплатыНаСервере()
	Обработки.ОбменССайтом.ВыгрузитьОплаты(ПериодВыборкиТранзакций.ДатаНачала, ПериодВыборкиТранзакций.ДатаОкончания);
КонецПроцедуры	

#КонецОбласти
