
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтруктураЗаполнения") = Истина Тогда
		//@skip-check unknown-form-parameter-access
		ЗаполнитьКарты(Параметры.СтруктураЗаполнения);
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		СтрокаТаблицы.Обработать = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		СтрокаТаблицы.Обработать = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьКарты(Команда)	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	ЗаблокироватьКартыНаСервере();	 
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьКарты(Команда)
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		Если Не СтрокаТаблицы.Обработать Тогда
			Продолжить;
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Заполнить карты.
// 
// Параметры:
//  СтруктураЗаполнения - Структура:
//  *Контрагент - СправочникСсылка.Контрагенты
&НаСервере
Процедура ЗаполнитьКарты(СтруктураЗаполнения)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Владелец", СтруктураЗаполнения.Контрагент);
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Владелец,
	|	Карточки.Ссылка КАК Карта,
	|	Карточки.ДатаБлокировкиРазблокировки,
	|	Карточки.Блокировка,
	|	Карточки.Архивная
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	Карточки.Владелец = &Владелец";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Карты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьКартыНаСервере()
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		Если Не СтрокаТаблицы.Обработать Тогда
			Продолжить;
		КонецЕсли;	
	КонецЦикла;	
	//@skip-check reading-attribute-from-database
	МодульОбработки = ЗагрузкаОбщий.ПолучитьМодульЗагрузкиПоПеречислению(Объект.Эмитент.МодульОбмена);
	СтруктураРезультат = МодульОбработки.ЗаблокироватьКарту(Объект.Эмитент, СтрокаТаблицы.Карта);
КонецПроцедуры	

#КонецОбласти
