
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СтруктураЗаполнения") = Истина Тогда
		//@skip-check unknown-form-parameter-access
		ЗаполнитьКарты(Параметры.СтруктураЗаполнения);
	КонецЕсли;	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьВсе(Команда)
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		СтрокаТаблицы.Обработать = Истина;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		СтрокаТаблицы.Обработать = Ложь;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаблокироватьКарты(Команда)	
	ЗаблокироватьКартыНаСервере();	 
КонецПроцедуры

&НаКлиенте
Процедура РазблокироватьКарты(Команда)
	РазблокироватьКартыНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнить карты.
// 
// Параметры:
//  СтруктураЗаполнения - Структура:
//  *Контрагент - СправочникСсылка.Контрагенты
&НаСервере
Процедура ЗаполнитьКарты(СтруктураЗаполнения)
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Владелец", СтруктураЗаполнения.Контрагент);
	Запрос.Текст = "ВЫБРАТЬ
	|	Карточки.Владелец,
	|	Карточки.Ссылка КАК Карта,
	|	Карточки.ДатаБлокировкиРазблокировки,
	|	Карточки.Блокировка,
	|	Карточки.Архивная,
	|	Карточки.Эмитент
	|ИЗ
	|	Справочник.Карточки КАК Карточки
	|ГДЕ
	|	Карточки.Владелец = &Владелец";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Карты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьКартуНаСервере(СтрокаТаблицы)
	СтрокаТаблицы.Ошибка = Ложь;
	//@skip-check reading-attribute-from-database
	МодульОбработки = ЗагрузкаОбщий.ПолучитьМодульЗагрузкиПоПеречислению(СтрокаТаблицы.Эмитент.МодульОбмена);
	Если МодульОбработки = Неопределено Тогда
		СтрокаТаблицы.Ошибка = Истина;
		СтрокаТаблицы.РезультатОбработки = СтрШаблон("Модуль обработки не найден");
		Возврат;
	КонецЕсли;	
	
	СтруктураРезультат = МодульОбработки.ЗаблокироватьКарту(СтрокаТаблицы.Эмитент, СтрокаТаблицы.Карта);
	
	СтрокаТаблицы.Ошибка = Не СтруктураРезультат.Результат;
	Если Не СтруктураРезультат.Результат Тогда
		СтрокаТаблицы.РезультатОбработки = СтрСоединить(СтруктураРезультат.МассивОшибок, Символы.ПС);
	Иначе
		КартаОбъект = СтрокаТаблицы.Карта.ПолучитьОбъект();
		КартаОбъект.Блокировка = Истина;
		КартаОбъект.ДатаБлокировкиРазблокировки = ТекущаяДатаСеанса();
		КартаОбъект.Записать();
		
		СтрокаТаблицы.Блокировка = Истина;
		СтрокаТаблицы.ДатаБлокировкиРазблокировки = КартаОбъект.ДатаБлокировкиРазблокировки; 
		
		СтрокаТаблицы.РезультатОбработки = "Ok!";	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура РазблокироватьКартуНаСервере(СтрокаТаблицы)
	СтрокаТаблицы.Ошибка = Ложь;
	//@skip-check reading-attribute-from-database
	МодульОбработки = ЗагрузкаОбщий.ПолучитьМодульЗагрузкиПоПеречислению(СтрокаТаблицы.Эмитент.МодульОбмена);
	Если МодульОбработки = Неопределено Тогда
		СтрокаТаблицы.Ошибка = Истина;
		СтрокаТаблицы.РезультатОбработки = СтрШаблон("Модуль обработки не найден");
		Возврат;
	КонецЕсли;
	СтруктураРезультат = МодульОбработки.РазблокироватьКарту(СтрокаТаблицы.Эмитент, СтрокаТаблицы.Карта);
	
	СтрокаТаблицы.Ошибка = Не СтруктураРезультат.Результат;
	Если Не СтруктураРезультат.Результат Тогда
		СтрокаТаблицы.РезультатОбработки = СтрСоединить(СтруктураРезультат.МассивОшибок, Символы.ПС);
	Иначе
		КартаОбъект = СтрокаТаблицы.Карта.ПолучитьОбъект();
		КартаОбъект.Блокировка = Ложь;
		КартаОбъект.ДатаБлокировкиРазблокировки = ТекущаяДатаСеанса();
		КартаОбъект.Записать();
		
		СтрокаТаблицы.Блокировка = Ложь;
		СтрокаТаблицы.ДатаБлокировкиРазблокировки = КартаОбъект.ДатаБлокировкиРазблокировки; 
		
		СтрокаТаблицы.РезультатОбработки = "Ok!";	
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаблокироватьКартыНаСервере()
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		Если Не СтрокаТаблицы.Обработать Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			ЗаблокироватьКартуНаСервере(СтрокаТаблицы);
		Исключение
			СтрокаТаблицы.РезультатОбработки = ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура РазблокироватьКартыНаСервере()
	Для Каждого СтрокаТаблицы Из Объект.Карты Цикл
		Если Не СтрокаТаблицы.Обработать Тогда
			Продолжить;
		КонецЕсли;

		Попытка
			РазблокироватьКартуНаСервере(СтрокаТаблицы);
		Исключение
			СтрокаТаблицы.РезультатОбработки = ОписаниеОшибки();
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
